{
  "RepeatedBehavior": {
    "title": "Repeated or Continuous Behaviour",
    "intro": "This section highlights how certain harmful actions repeat in cycles until they start to feel normal.",
    "description": "Coercive control rarely happens in one big moment. It builds through small, recurring patterns—confusion followed by comfort, guilt followed by affection, distance followed by closeness. Over time these cycles change how you respond, what you fear, and how you see yourself. This section helps you recognize behaviours that slowly shaped your emotional world through repetition.",
    "offender_behavior": [
      {
        "ref": "O-RA1",
        "text": "Ongoing manipulation over weeks or months",
        "checked": false,
        "user_added": false,
        "description": "This is not a one-off argument; it is a sustained campaign to wear down your resistance and change your reality.",
        "example": "He consistently makes subtle, negative comments about your appearance every morning until you stop dressing the way you like."
      },
      {
        "ref": "O-RA2",
        "text": "Repeated interference in relationships",
        "checked": false,
        "user_added": false,
        "description": "He systematically disrupts your connections with others to ensure he is the only voice in your ear.",
        "example": "Every time it is convenient for him he allows you to reach out just to make you feel guilt for doing so afterwards, forcing you into the position where you are now taking advantage of other and then discarding."
      },
      {
        "ref": "O-RA3",
        "text": "Consistent rewriting of events and intentions",
        "checked": false,
        "user_added": false,
        "description": "He refuses to let the truth stand, constantly altering the past to make himself the hero or the victim.",
        "example": "You remember him behaving badly, manipulative, cruel but then just days later he makes it sound like he was just looking out for you or that he had no choice or that he is the only one that saw the harm that he put a stop to"
      },
      {
        "ref": "O-RA4",
        "text": "Showing up during emotionally vulnerable moments",
        "checked": false,
        "user_added": false,
        "description": "He exploits times when your defenses are down to imprint his influence or gather ammunition for later.",
        "example": "When you are grieving a loss or stressed about work, he swoops in to 'help,' but uses that time to tell you who you can and cannot trust."
      },
      {
        "ref": "O-RA5",
        "text": "A pattern of chaos: warm → cold → guilt → relief",
        "checked": false,
        "user_added": false,
        "description": "He manufactures instability to keep you off balance, ensuring you are always working to get back to the 'good' phase.",
        "example": "He ignores you for two days (cold), blames you for his silence (guilt), then buys you a gift (relief) so you feel grateful he's back."
      },
      {
        "ref": "O-RA6",
        "text": "Emotional withdrawal as punishment repeated many times",
        "checked": false,
        "user_added": false,
        "description": "He uses his silence and absence as a weapon to train you to comply with his wishes.",
        "example": "Whenever you disagree with him, he leaves the room and refuses to acknowledge your existence until you apologize."
      },
      {
        "ref": "O-RA7",
        "text": "Long-term monitoring of her emotional state",
        "checked": false,
        "user_added": false,
        "description": "He watches your moods closely, not to support you, but to anticipate how to manage or manipulate you.",
        "example": "He constantly asks 'Why are you so quiet?' or 'What are you thinking?' because he fears you are mentally drifting away from his control."
      },
      {
        "ref": "O-RA8",
        "text": "Repeatedly inserting himself into conflicts",
        "checked": false,
        "user_added": false,
        "description": "He ensures he is central to every problem, often escalating minor issues so that he can control the outcome.",
        "example": "If you have a disagreement with a friend, he takes over the texting or calling to 'defend' you, effectively cutting off your ability to resolve it yourself."
      },
      {
        "ref": "O-RA9",
        "text": "Continuous shaping of her perceptions about others",
        "checked": false,
        "user_added": false,
        "description": "He drips poison about your loved ones into your ear until you start viewing your support network as enemies.",
        "example": "He frequently says, 'I don't think your mother actually wants you to be happy,' until you start doubting her intentions."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-RB1",
        "text": "She becomes unusually defensive of him even when it's irrational or harmful to herself.",
        "checked": false,
        "user_added": false,
        "description": "You defend him not because you agree, but because it feels safer to align with him than to face the terrifying reality of who he is.",
        "example": "When a friend points out he was rude to you, you immediately say, 'He's just under a lot of stress,' effectively shielding him from accountability."
      },
      {
        "ref": "V-RB2",
        "text": "She pulls away from supportive people slowly over time without clear reasons.",
        "checked": false,
        "user_added": false,
        "description": "You aren't choosing loneliness; you are unconsciously removing sources of friction to avoid his jealousy or judgment.",
        "example": "You stop answering calls from your best friend because you know it will lead to an interrogation from him later."
      },
      {
        "ref": "V-RB3",
        "text": "She adopts his narrative and repeats phrases that sound like they came from him.",
        "vicchecktim": [],
        "description": "Your own inner voice has been drowned out by his repetition, leading you to speak his thoughts as if they were your own.",
        "example": "You catch yourself saying, 'I just need to learn not to push his buttons,' using his exact justification for his anger."
      },
      {
        "ref": "V-RB4",
        "text": "She forgets or mistrusts her own memories and instead relies on what he said happened.",
        "checked": false,
        "user_added": false,
        "description": "Gaslighting has exhausted your cognitive trust; it feels easier to accept his version than to fight the mental fog.",
        "example": "You vaguely remember him agreeing to a plan, but when he denies it, you assume you must have misunderstood him again."
      },
      {
        "ref": "V-RB5",
        "text": "She becomes hyper-aware of what might upset him and adjusts her behavior accordingly.",
        "checked": false,
        "user_added": false,
        "description": "You have developed a survival radar, constantly scanning for danger to prevent an emotional explosion.",
        "example": "You check your phone obsessively to make sure you reply instantly, knowing that a delay will cause an accusation."
      },
      {
        "ref": "V-RB6",
        "text": "She avoids conflict and shuts down emotionally when his behavior is questioned.",
        "checked": false,
        "user_added": false,
        "description": "Your nervous system is overwhelmed; shutting down is a protective mechanism to conserve energy and avoid pain.",
        "example": "When someone asks if you are okay, you go blank and change the subject because the truth is too heavy to carry."
      },
      {
        "ref": "V-RB7",
        "text": "Her decisions become inconsistent because she is reacting to emotional pressure rather than personal preference.",
        "checked": false,
        "user_added": false,
        "description": "You aren't indecisive; you are trying to survive a shifting environment where the 'right' choice changes based on his mood.",
        "example": "You agree to go out, then cancel last minute, then agree again, all based on the subtle signals of approval or disapproval he gives."
      },
      {
        "ref": "V-R8",
        "text": "She hides or minimizes things she would previously have openly shared.",
        "checked": false,
        "user_added": false,
        "description": "Secrecy becomes safety. You hide parts of your life to keep them untouched by his criticism or control.",
        "example": "You buy a coffee and throw away the receipt immediately so he doesn't question why you spent money."
      },
      {
        "ref": "V-RB9",
        "text": "She starts to defend lies or distortions because she believes confronting them will cause emotional instability.",
        "checked": false,
        "user_added": false,
        "description": "Peace feels more important than truth right now. You accept the lie because challenging it brings chaos you cannot handle.",
        "example": "You nod along when he tells a false story to friends, terrified that correcting him will lead to a fight in the car later."
      },
      {
        "ref": "V-RB10",
        "text": "She prioritizes the abuser's emotional needs over her own well-being or safety.",
        "checked": false,
        "user_added": false,
        "description": "You have been conditioned to believe that his happiness is the prerequisite for your safety.",
        "example": "You stay up all night comforting him about his work stress, even though you are sick and have an early shift, because you fear his reaction if you sleep."
      }
    ]
  },
  "ControllingBehavior": {
    "title": "Controlling or Coercive Behaviour",
    "intro": "This section focuses on how someone can influence your thoughts, emotions, and choices without you noticing.",
    "description": "Control doesn't always look like force. It often looks like guilt, pressure, withdrawal, rewriting events, isolation, or emotional dependency. Over time, this kind of control makes you doubt your own instincts and trust their reactions instead of your own. This section shows how subtle behaviours can turn into powerful psychological control.",
    "offender_behavior": [
      {
        "ref": "O-CA1",
        "text": "Isolation from friends, family, or emotional supports",
        "checked": false,
        "user_added": false,
        "description": "He systematically cuts your lifelines so that he becomes your only source of reality and support.",
        "example": "He acts sulky or hurt every time you visit your parents, eventually making you feel it's easier to just stay home."
      },
      {
        "ref": "O-CA2",
        "text": "Distorting reality or rewriting events",
        "checked": false,
        "user_added": false,
        "description": "He denies facts to make you question your sanity, ensuring you rely on his memory instead of yours.",
        "example": "He tells you that you never mentioned an appointment, even though you wrote it on the shared calendar together."
      },
      {
        "ref": "O-CA3",
        "text": "Inducing guilt or shame to influence decisions",
        "checked": false,
        "user_added": false,
        "description": "He weaponizes your empathy, making you feel like a 'bad partner' whenever you do something for yourself.",
        "example": "He says, 'If you really loved me, you wouldn't go out tonight,' twisting your independence into a betrayal."
      },
      {
        "ref": "O-CA4",
        "text": "Using emotional withdrawal as control",
        "checked": false,
        "user_added": false,
        "description": "He creates a cold emotional climate to punish you, forcing you to 'earn' back his warmth through compliance.",
        "example": "He stops looking at you or speaking to you for days because you bought something he didn't approve of."
      },
      {
        "ref": "O-CA5",
        "text": "Creating dependency during vulnerable times",
        "checked": false,
        "user_added": false,
        "description": "He waits until you are weak or struggling to step in and take over, ensuring you feel you can't survive without him.",
        "example": "When you lose your job, he insists on managing your finances 'to help,' but then restricts your access to money."
      },
      {
        "ref": "O-CA6",
        "text": "Becoming indispensable by inserting himself into crises",
        "checked": false,
        "user_added": false,
        "description": "He wants to be the savior in every situation, often exacerbating the problem so only he can fix it.",
        "example": "He demands to speak to your boss when you have a work conflict, preventing you from handling it professionally yourself."
      },
      {
        "ref": "O-CA7",
        "text": "Implying or suggesting consequences without stating them",
        "checked": false,
        "user_added": false,
        "description": "He uses vague threats to keep you fearful, allowing your imagination to create the worst-case scenarios.",
        "example": "He says, 'You'd better hope nothing happens while you're gone,' leaving you terrified to leave the house."
      },
      {
        "ref": "O-CA8",
        "text": "Monitoring communications or emotional states",
        "checked": false,
        "user_added": false,
        "description": "He invades your privacy under the guise of 'closeness,' treating your thoughts and messages as his property.",
        "example": "He demands to know who you are texting and gets angry if you don't unlock your phone for him immediately."
      },
      {
        "ref": "O-C9",
        "text": "Framing himself as the only safe or trustworthy person",
        "checked": false,
        "user_added": false,
        "description": "He paints the rest of the world as dangerous or against you, so you run to him for safety.",
        "example": "He tells you that your friends talk behind your back, convincing you that he is the only one who is truly loyal."
      },
      {
        "ref": "O-CA10",
        "text": "Playing the victim to gain emotional leverage",
        "checked": false,
        "user_added": false,
        "description": "He flips the script when confronted, acting hurt so that you end up comforting him for his abuse.",
        "example": "When you cry because he shouted at you, he says, 'It hurts me to see you like this, why do you make me feel so guilty?'"
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-CB1",
        "text": "She avoids people who might expose the abuser's influence or who encourage her independence.",
        "checked": false,
        "user_added": false,
        "description": "You unconsciously distance yourself from truth-tellers because their concern creates a conflict you aren't ready to face.",
        "example": "You avoid meeting a friend who previously asked if you were happy, fearing she will see the bruises on your soul."
      },
      {
        "ref": "V-C2",
        "text": "She repeats his version of events even when it contradicts her own lived experience.",
        "checked": false,
        "user_added": false,
        "description": "It is mentally exhausting to hold onto your own reality when it is constantly denied; surrendering to his truth feels like relief.",
        "example": "You tell yourself 'it wasn't that bad' because admitting how bad it was feels too dangerous."
      },
      {
        "ref": "V-CB3",
        "text": "She becomes confused easily and unsure what is real or what actually happened.",
        "checked": false,
        "user_added": false,
        "description": "The constant manipulation has scrambled your internal compass, making you feel like you are losing your mind.",
        "example": "You genuinely cannot remember if you turned the stove off because he has told you so many times that you are forgetful."
      },
      {
        "ref": "V-CB4",
        "text": "She apologizes excessively for things that are not her fault.",
        "checked": false,
        "user_added": false,
        "description": "Apologizing has become a survival reflex to de-escalate tension, regardless of who caused it.",
        "example": "You say 'I'm sorry' when he drops a glass, just to prevent him from getting angry about the mess."
      },
      {
        "ref": "V-CB5",
        "text": "She experiences guilt for questioning him, even when she has legitimate concerns.",
        "checked": false,
        "user_added": false,
        "description": "You have been trained to view your own needs or questions as acts of betrayal.",
        "example": "You feel a knot of shame in your stomach simply for wondering why he came home so late."
      },
      {
        "ref": "V-CB6",
        "text": "She fears upsetting him and begins making decisions based on avoiding his disappointment.",
        "checked": false,
        "user_added": false,
        "description": "Your life has shrunk to a single goal: keeping him calm. Your own desires have been pushed aside.",
        "example": "You turn down a job promotion because you know he will feel insecure and make your life difficult if you earn more than him."
      },
      {
        "ref": "V-CB7",
        "text": "She starts lying or hiding things to maintain stability with him.",
        "checked": false,
        "user_added": false,
        "description": "You lie not to be deceptive, but to create a small buffer of safety where you can't be criticized.",
        "example": "You say you paid $20 for a dress instead of $50 so you don't have to endure a lecture on responsibility."
      },
      {
        "ref": "V-CB8",
        "text": "She shows signs of dependency, believing only he understands or supports her.",
        "checked": false,
        "user_added": false,
        "description": "The isolation has worked; you feel like a boat adrift and he is the only anchor, even if the anchor is dragging you down.",
        "example": "You feel panic when you can't reach him, thinking, 'I don't know what to do without him.'"
      },
      {
        "ref": "V-CB9",
        "text": "She becomes emotionally numb or dissociated when discussing him or her situation.",
        "checked": false,
        "user_added": false,
        "description": "Your emotions are too painful to feel, so your body has disconnected from them to keep you functioning.",
        "example": "You talk about his lies and manipulation like it is in the past and you are moving forward."
      },
      {
        "ref": "V-CB10",
        "text": "She rationalizes or defends his harmful actions as if they were justified or unavoidable.",
        "checked": false,
        "user_added": false,
        "description": "You rationalize his abuse to protect the image of the relationship you wish you had.",
        "example": "You tell yourself, 'He only does that because I have been forgetful of what I know is best for me,' framing his control as love."
      }
    ]
  },
  "SeriousEffect": {
    "title": "Serious Psychological or Emotional Effect",
    "intro": "This section outlines the emotional impact that changes how you feel, think, or function day to day.",
    "description": "When manipulation continues long enough, it affects your emotional stability—creating anxiety, confusion, self-doubt, emotional shutdowns, and instability. It can change how you communicate, how safe you feel, and how much of yourself you show. This section helps you understand the deeper emotional consequences of being controlled or destabilized.",
    "offender_behavior": [
      {
        "ref": "O-SE1",
        "text": "Changes in day-to-day behaviour caused by emotional pressure",
        "checked": false,
        "user_added": false,
        "description": "His pressure forces you to alter your routine, not because you want to, but to survive his reactions.",
        "example": "He calls you every hour at work, forcing you to step out of meetings, eventually putting your job at risk."
      },
      {
        "ref": "O-SE2",
        "text": "Fear of upsetting the abuser even without physical threats",
        "checked": false,
        "user_added": false,
        "description": "He has instilled such a deep fear of his disapproval that he doesn't need to raise a hand to control you.",
        "example": "You feel your heart race and palms sweat just because you forgot to buy the specific milk he likes."
      },
      {
        "ref": "O-SE3",
        "text": "Inability to make independent decisions",
        "checked": false,
        "user_added": false,
        "description": "He has eroded your confidence so thoroughly that you feel incapable of choosing even lunch without his input.",
        "example": "You stand in the grocery aisle paralyzed, calling him to ask which pasta sauce to buy."
      },
      {
        "ref": "O-SE4",
        "text": "Losing access to support networks and emotional anchors",
        "checked": false,
        "user_added": false,
        "description": "He has successfully severed the ties that kept you grounded, leaving you floating in his reality.",
        "example": "He has made it so difficult to see your family that you haven't seen them in six months."
      },
      {
        "ref": "O-SE5",
        "text": "Dramatic mood swings triggered by interactions with the abuser",
        "checked": false,
        "user_added": false,
        "description": "He acts as the puppet master of your emotions, pulling strings to make you happy or devastated on a whim.",
        "example": "You go from feeling fine to sobbing on the floor within five minutes of him walking through the door."
      },
      {
        "ref": "O-SE6",
        "text": "Long-term emotional instability and confusion",
        "checked": false,
        "user_added": false,
        "description": "He creates a perpetual state of fog where you never feel settled or safe in your own mind.",
        "example": "You feel a constant, low-level hum of anxiety even when he isn't there, unable to relax."
      },
      {
        "ref": "O-SE7",
        "text": "Personality changes inconsistent with her usual identity",
        "checked": false,
        "user_added": false,
        "description": "He crushes your authentic self, forcing you to become a shadow version that fits his needs.",
        "example": "You used to be the life of the party, but now you sit silently in the corner, afraid to speak."
      },
      {
        "ref": "O-SE8",
        "text": "Developing anxiety or panic around normal interactions",
        "checked": false,
        "user_added": false,
        "description": "He has conditioned you to associate innocent conversations with danger and punishment.",
        "example": "You have a panic attack when a male cashier speaks to you, terrified he might have seen it."
      },
      {
        "ref": "O-SE9",
        "text": "Emotional shutdown when confronted with truth",
        "checked": false,
        "user_added": false,
        "description": "He has made the truth so painful that your mind simply refuses to process it anymore.",
        "example": "When a friend shows you proof of his lies, you stare blankly at the wall, unable to respond."
      },
      {
        "ref": "O-SE10",
        "text": "Reduced ability to think clearly or process information",
        "checked": false,
        "user_added": false,
        "description": "He keeps you in a state of cognitive overload, making it impossible for you to think straight.",
        "example": "You find yourself reading the same sentence over and over, unable to focus because your brain is constantly scanning for threats."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-SEB1",
        "text": "Her personality shifts drastically, becoming more fearful, more avoidant, or more dependent.",
        "checked": false,
        "user_added": false,
        "description": "You are adapting to a hostile environment; these changes are survival tactics, not flaws in your character.",
        "example": "Friends ask 'Where did the old you go?' because you have become quiet and shrinking to stay safe."
      },
      {
        "ref": "V-SEB2",
        "text": "She shows increased indecision, especially around things that used to be easy for her.",
        "checked": false,
        "user_added": false,
        "description": "Your trust in your own judgment has been damaged, making every choice feel like a potential trap.",
        "example": "You struggle to pick a movie to watch, terrified that choosing the 'wrong' one will ruin the evening."
      },
      {
        "ref": "V-SEB3",
        "text": "She experiences panic or emotional freezing when his name or behavior is discussed.",
        "checked": false,
        "user_added": false,
        "description": "Your body remembers the trauma even if your mind tries to minimize it; his name is a trigger.",
        "example": "Your throat closes up and your hands shake when someone asks, 'How is your partner doing?'"
      },
      {
        "ref": "V-SEB4",
        "text": "She appears mentally and emotionally exhausted, with reduced ability to cope.",
        "checked": false,
        "user_added": false,
        "description": "Living in a state of high alert burns intense energy; you are tired because you are always fighting invisible battles.",
        "example": "Small tasks like doing the laundry feel insurmountable because you have no emotional reserves left."
      },
      {
        "ref": "V-SEB5",
        "text": "She becomes disconnected from her support network and isolates herself unintentionally.",
        "checked": false,
        "user_added": false,
        "description": "You drift away from love because maintaining two worlds—the real one and his one—is too exhausting.",
        "example": "You stop returning texts from your mom, not because you don't love her, but because you don't have the energy to explain your life."
      },
      {
        "ref": "V-SEB6",
        "text": "She begins acting out of character, showing behaviors inconsistent with her core self.",
        "checked": false,
        "user_added": false,
        "description": "Trauma pushes you to extremes; you are acting from a place of desperation, not your true nature.",
        "example": "You scream at a supportive friend, projecting the anger you can't safely express to him."
      },
      {
        "ref": "V-SEB7",
        "text": "She prioritizes his emotions and needs above her own safety or well-being.",
        "checked": false,
        "user_added": false,
        "description": "You have been conditioned to view his well-being as the only thing that matters, erasing your own.",
        "example": "You drive in a dangerous snowstorm to pick him up because he demanded it, ignoring the risk to your own life."
      },
      {
        "ref": "V-SEB8",
        "text": "She loses long-term vision and can only think in terms of what keeps her safe right now.",
        "checked": false,
        "user_added": false,
        "description": "Survival mode limits your view to the immediate moment; you can't plan for next year when you're trying to survive today.",
        "example": "You stop saving money for your future because you are focused entirely on getting through the current week without a fight."
      },
      {
        "ref": "V-SEB9",
        "text": "She becomes unable to discuss what happened without shutting down emotionally.",
        "checked": false,
        "user_added": false,
        "description": "The memories are too raw to touch; your mind pulls the emergency brake to stop the pain.",
        "example": "You start to tell a therapist about an incident but suddenly go silent and say, 'It doesn't matter, I'm fine.'"
      },
      {
        "ref": "V-SEB10",
        "text": "She acts as if she is responsible for the abuser's emotional state or consequences.",
        "checked": false,
        "user_added": false,
        "description": "You carry the weight of his actions, falsely believing that if you just try harder, he will be better.",
        "example": "You blame yourself for him losing his temper, thinking, 'If I hadn't asked that question, he wouldn't have broken the door.'"
      }
    ]
  },
  "OughtToHaveKnown": {
    "title": "They Ought to Have Known Their Behaviour Would Cause Harm",
    "intro": "This section identifies behaviours that any reasonable person should know would damage someone emotionally.",
    "description": "Even if the abuser claims they 'didn't mean it,' their actions reveal awareness. Timing emotional pressure, isolating you, guilt-tripping you, monitoring you, or taking advantage of your vulnerability all show a clear understanding of how their behaviour affects you. This section helps highlight actions that were knowingly harmful—even if denied.",
    "offender_behavior": [
      {
        "ref": "O-KA1",
        "text": "Behavior shows awareness of timing, planning, or strategic influence",
        "checked": false,
        "user_added": false,
        "description": "He doesn't explode randomly; he waits until it will have the most impact, showing he is in control.",
        "example": "He picks a fight right before your job interview to unsettle you, ensuring you are distracted and perform poorly."
      },
      {
        "ref": "O-KA2",
        "text": "He acts differently when others are around",
        "checked": false,
        "user_added": false,
        "description": "This proves his behavior is a choice. If he can be charming to the neighbors, he has the capacity to control his temper.",
        "example": "He screams at you in the car but switches to a smiling, polite demeanor the second you arrive at the party."
      },
      {
        "ref": "O-KA3",
        "text": "He hides parts of his interactions with her",
        "checked": false,
        "user_added": false,
        "description": "He knows what he is doing is wrong, so he conceals the evidence to protect his reputation.",
        "example": "He whispers cruel insults in your ear where no one else can hear, then acts shocked if you react loudly."
      },
      {
        "ref": "O-KA4",
        "text": "He manipulates narratives to position himself favourably",
        "checked": false,
        "user_added": false,
        "description": "He actively crafts a story where he is the victim, showing he understands the social consequences of his actions.",
        "example": "After locking you out of the house, he tells friends he was 'just giving you space to cool off,' making him sound reasonable."
      },
      {
        "ref": "O-KA5",
        "text": "He exhibits emotional flatness or lack of empathy when confronted",
        "checked": false,
        "user_added": false,
        "description": "He sees your pain not as a tragedy, but as an inconvenience or a tool to be used.",
        "example": "You are crying and begging him to stop, and he just watches you with a blank, bored expression."
      },
      {
        "ref": "O-KA6",
        "text": "He uses knowledge of her vulnerabilities intentionally",
        "checked": false,
        "user_added": false,
        "description": "He weaponizes the secrets you trusted him with to cause maximum hurt.",
        "example": "He brings up your past trauma during an argument to shut you down, knowing it will paralyze you."
      },
      {
        "ref": "O-KA",
        "text": "His actions indicate awareness of consequences",
        "checked": false,
        "user_added": false,
        "description": "He knows exactly how far he can push without losing you or getting caught.",
        "example": "He threatens to hit you but stops his fist just inches from your face, showing he has precise control over his violence."
      },
      {
        "ref": "O-KA8",
        "text": "He frames himself as the victim to deflect blame",
        "checked": false,
        "user_added": false,
        "description": "He uses DARVO (Deny, Attack, Reverse Victim and Offender) to escape accountability.",
        "example": "When you confront him about cheating, he accuses you of not trusting him and making him feel unloved."
      },
      {
        "ref": "O-KA9",
        "text": "He strategically distances her from you or others",
        "checked": false,
        "user_added": false,
        "description": "He knows that isolated people are easier to control, so he methodically cuts your ties.",
        "example": "He tells you your sister 'disrespected' him so you have to choose between them, forcing you to cut her off."
      },
      {
        "ref": "O-KA10",
        "text": "He threatens or implies consequences to gain control",
        "checked": false,
        "user_added": false,
        "description": "He uses fear as a tool, understanding that the threat of pain is often enough to ensure obedience.",
        "example": "He casually mentions how 'shameful' it would be if your secrets got out, implying he will leak them if you leave."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-KB1",
        "text": "She hides or minimizes details because she knows he would react negatively.",
        "checked": false,
        "user_added": false,
        "description": "You are editing your life to avoid punishment, a clear sign you are living under threat.",
        "example": "You delete a text from a male coworker about a meeting, knowing he will twist it into an affair."
      },
      {
        "ref": "V-KB2",
        "text": "She defends his behavior, suggesting he 'means well' even when he clearly doesn't.",
        "checked": false,
        "user_added": false,
        "description": "You are trying to bridge the gap between the man you love and the man who hurts you.",
        "example": "You tell yourself he only criticized your weight because he wants you to be healthy, ignoring the cruelty in his voice."
      },
      {
        "ref": "V-KB3",
        "text": "She fears being honest about what happened, showing signs of internalized threat.",
        "checked": false,
        "user_added": false,
        "description": "Your body knows it is not safe to speak the truth, even if your mind is trying to rationalize it.",
        "example": "When a doctor asks about a bruise, you instinctively lie and say you fell, terrified he might find out you told."
      },
      {
        "ref": "V-K4",
        "text": "She becomes agitated or distressed when confronted with contradictions in his story.",
        "checked": false,
        "user_added": false,
        "description": "Cognitive dissonance is painful; seeing his lies exposed hurts because it threatens the reality you are trying to maintain.",
        "example": "You get angry at a friend for proving he lied, because acknowledging the lie means acknowledging the abuse."
      },
      {
        "ref": "V-KB5",
        "text": "She protects him instinctively, as if revealing anything negative would put her at risk.",
        "checked": false,
        "user_added": false,
        "description": "You have absorbed the rule that protecting his image is essential for your survival.",
        "example": "You clean up the broken glass before anyone sees it so no one knows he threw it."
      },
      {
        "ref": "V-KB6",
        "text": "She seems to anticipate his emotional responses even when he is not present.",
        "checked": false,
        "user_added": false,
        "description": "He lives in your head rent-free; you are constantly running simulations of his reactions.",
        "example": "You are shopping alone and put back an item because you can hear his voice criticizing the price."
      },
      {
        "ref": "V-KB7",
        "text": "She shows signs of guilt for things she never did, indicating manipulation.",
        "checked": false,
        "user_added": false,
        "description": "He has projected so much blame onto you that you have started to accept it as your own.",
        "example": "You feel guilty that he had a bad day at work, as if you should have somehow prevented it."
      },
      {
        "ref": "V-KB8",
        "text": "She becomes confused or disoriented when questioned directly about him.",
        "checked": false,
        "user_added": false,
        "description": "Direct questions pierce the fog he created, causing mental chaos as you try to reconcile the truth with his narrative.",
        "example": "When asked 'Is he good to you?', you stammer and can't find a simple 'yes'."
      },
      {
        "ref": "V-KB9",
        "text": "She avoids certain topics entirely because she associates them with emotional danger.",
        "checked": false,
        "user_added": false,
        "description": "You have learned which buttons not to press to keep the peace.",
        "example": "You never mention your career goals because you know it triggers his insecurity and rage."
      },
      {
        "ref": "V-KB10",
        "text": "She behaves as if upsetting him has significant emotional consequences for her safety.",
        "checked": false,
        "user_added": false,
        "description": "Your fear is a rational response to the consequences he has demonstrated in the past.",
        "example": "You drive recklessly to get home on time because being late feels life-threatening."
      }
    ]
  },
  "PersonallyConnected": {
    "title": "Personally Connected (UK Legal Context)",
    "intro": "This section describes how certain behaviours are viewed differently when they happen between people who are emotionally or relationally close.",
    "description": "The law recognises that patterns in intimate or family relationships can have a stronger impact because of trust, emotional closeness, shared history, and dependency. This section explains how connection changes the way certain behaviours affect a person’s wellbeing and stability.",
    "offender_behavior": [
      {
        "ref": "O-PA1",
        "text": "Living together temporarily or long-term",
        "checked": false,
        "user_added": false,
        "description": "He uses shared space to create a surveillance environment where you have no escape.",
        "example": "He moved in 'temporarily' but now controls the household routine and refuses to leave."
      },
      {
        "ref": "O-PA2",
        "text": "Relying on him for shelter, emotional support, or resources",
        "checked": false,
        "user_added": false,
        "description": "He cultivates your dependence so that leaving him means losing your home or stability.",
        "example": "He insists on paying the rent so he can hold it over your head during arguments."
      },
      {
        "ref": "O-PA3",
        "text": "He positions himself as caregiver, protector, or savior",
        "checked": false,
        "user_added": false,
        "description": "He disguises control as care, making you feel ungrateful for resisting his 'help.'",
        "example": "He insists on driving you everywhere 'for your safety,' effectively trapping you in his car."
      },
      {
        "ref": "O-PA4",
        "text": "He steps into a partner-like role without formal relationship labels",
        "checked": false,
        "user_added": false,
        "description": "He demands the privileges of a partner (loyalty, intimacy) without the commitment, keeping you insecure.",
        "example": "He says he 'doesn't like labels' but gets furious if you talk to other men."
      },
      {
        "ref": "O-PA5",
        "text": "He creates obligation or debt-based loyalty",
        "checked": false,
        "user_added": false,
        "description": "He keeps a scorecard of everything he does for you to demand submission in return.",
        "example": "He reminds you constantly that he helped you fix your car, implying you owe him your obedience."
      },
      {
        "ref": "O-PA6",
        "text": "He gains influence during moments of vulnerability",
        "checked": false,
        "user_added": false,
        "description": "He targets you when you are weak to establish himself as essential.",
        "example": "He moved quickly to support you after a breakup, securing his place in your life before you healed."
      },
      {
        "ref": "O-PA7",
        "text": "She treats him like a partner emotionally even if not officially",
        "checked": false,
        "user_added": false,
        "description": "He manipulates your feelings to extract partner-level devotion without earning it.",
        "example": "You find yourself factoring his opinion into every life decision, even though you aren't officially dating."
      },
      {
        "ref": "O-PA8",
        "text": "He behaves as if she belongs to him emotionally",
        "checked": false,
        "user_added": false,
        "description": "He views you as a possession rather than a person, entitled to your time and emotions.",
        "example": "He says, 'You're mine,' which sounds romantic but feels like a cage."
      },
      {
        "ref": "O-PA9",
        "text": "She expresses fear of disappointing him similar to partner dynamics",
        "checked": false,
        "user_added": false,
        "description": "He exploits your desire to please to make you police your own behavior.",
        "example": "You cancel plans with friends because you feel a deep dread that he will be 'disappointed' in you."
      },
      {
        "ref": "O-PA10",
        "text": "He inserts himself into decisions normally reserved for partners",
        "checked": false,
        "user_added": false,
        "description": "He oversteps boundaries to take ownership of your life choices.",
        "example": "He tells you which job offer to accept, acting as if he has a veto power over your career."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-PB1",
        "text": "She acts as if she owes him loyalty or secrecy.",
        "checked": false,
        "user_added": false,
        "description": "You feel a manufactured debt to him, believing you must pay him back with silence.",
        "example": "You don't tell anyone about his outbursts because you feel loyal to the 'good' version of him."
      },
      {
        "ref": "V-PB2",
        "text": "She accepts him in a partner-like emotional role even if she doesn't consciously acknowledge it.",
        "checked": false,
        "user_added": false,
        "description": "Your heart has been tricked into bonding with him, blurring the lines of what he actually is.",
        "example": "You call him first when you get good news, giving him the emotional placement of a spouse."
      },
      {
        "ref": "V-PB3",
        "text": "She defers to his emotional reactions when making choices.",
        "checked": false,
        "user_added": false,
        "description": "His mood has become the weather in your world; you dress according to his forecast.",
        "example": "You check his face before laughing at a joke to see if it's allowed."
      },
      {
        "ref": "V-PB4",
        "text": "She hides your existence or your interactions from him.",
        "checked": false,
        "user_added": false,
        "description": "You compartmentalize your life to keep the peace, knowing he destroys anything he doesn't control.",
        "example": "You delete call logs from your mother so he doesn't ask what you talked about."
      },
      {
        "ref": "V-PB5",
        "text": "She acts as if her emotional safety depends on his approval.",
        "checked": false,
        "user_added": false,
        "description": "You have learned that his approval equals safety, and his disapproval equals danger.",
        "example": "You feel a wave of immense relief when he smiles at you, as if you avoided a disaster."
      },
      {
        "ref": "V-PB6",
        "text": "She behaves as though hurting him emotionally would have serious consequences.",
        "checked": false,
        "user_added": false,
        "description": "You walk on eggshells because you know the punishment for 'hurting' him is disproportionate.",
        "example": "You don't break up with him because you are terrified of what he might do to himself or you."
      },
      {
        "ref": "V-PB7",
        "text": "She seems bound to him through responsibility rather than genuine desire.",
        "checked": false,
        "user_added": false,
        "description": "It feels like a job you can't quit rather than a relationship you want to be in.",
        "example": "You stay because you feel you are the only one who can 'save' him."
      },
      {
        "ref": "V-PB8",
        "text": "She becomes stressed when separated from his influence.",
        "checked": false,
        "user_added": false,
        "description": "Dependency creates withdrawal; you feel anxious without his direction because he stole your autonomy.",
        "example": "You feel lost and unable to relax when he goes away for the weekend."
      },
      {
        "ref": "V-PB9",
        "text": "She adopts emotional positions typical in partner dynamics.",
        "checked": false,
        "user_added": false,
        "description": "You are doing the emotional labor of a wife for someone who treats you like a subordinate.",
        "example": "You manage his appointments and soothe his ego, taking on the role of his emotional manager."
      },
      {
        "ref": "V-PB10",
        "text": "She experiences cognitive dissonance when reconciling her bond with him and her past with you.",
        "checked": false,
        "user_added": false,
        "description": "Your brain hurts trying to fit the 'loving' him and the 'abusive' him into one picture.",
        "example": "You struggle to explain to friends why you love him, because the words sound empty even to you."
      }
    ]
  },
  "FearAndAvoidancePatterns": {
    "title": "Fear and Avoidance Patterns",
    "intro": "This section focuses on behaviours shaped by fear, pressure, or emotional overwhelm.",
    "description": "Fear and avoidance can develop slowly when someone feels they must prevent conflict, protect someone's feelings, or keep a situation stable. These patterns often lead to self-silencing, emotional shutdowns, or avoiding actions that might trigger a negative response. This section highlights how fear and avoidance can shape daily behaviour without always being recognised.",
    "offender_behavior": [
      {
        "ref": "O-FA1",
        "text": "Fear of upsetting him even without explicit threats",
        "checked": false,
        "user_added": false,
        "description": "He uses 'the look' or heavy silence to terrify you, creating a climate of fear without words.",
        "example": "He stares at you coldly across the dinner table, and you stop eating immediately, knowing you've done something 'wrong'."
      },
      {
        "ref": "O-FA2",
        "text": "Changes in behavior to avoid triggering him",
        "checked": false,
        "user_added": false,
        "description": "He forces you to edit yourself until you are no longer a person, but a collection of avoidance strategies.",
        "example": "You stop wearing lipstick because he once made a snide comment about it, and it's not worth the risk."
      },
      {
        "ref": "O-FA3",
        "text": "Avoidance of topics related to truth or past events",
        "checked": false,
        "user_added": false,
        "description": "He creates 'no-go zones' in conversation to prevent you from holding him accountable.",
        "example": "He explodes with rage if you ever mention the night he scared you, ensuring you never bring it up again."
      },
      {
        "ref": "O-FA4",
        "text": "Fear-based decision-making instead of desire-based decision-making",
        "checked": false,
        "user_added": false,
        "description": "He ensures your life is driven by the need to avoid pain rather than the pursuit of happiness.",
        "example": "You choose a restaurant not because you like the food, but because it's the one he never complains about."
      },
      {
        "ref": "O-FA5",
        "text": "Freeze responses when confronted with his behavior",
        "checked": false,
        "user_added": false,
        "description": "He creates such overwhelming stress that your nervous system shuts down to survive.",
        "example": "When he starts shouting, you go completely still and silent, waiting for the storm to pass."
      },
      {
        "ref": "O-FA6",
        "text": "Inability to speak openly about him without anxiety",
        "checked": false,
        "user_added": false,
        "description": "He has trained you to feel like you are betraying him just by speaking his name.",
        "example": "You look over your shoulder and lower your voice when telling a friend about his mood swings."
      },
      {
        "ref": "O-FA7",
        "text": "Avoidance of supportive people who might challenge his influence",
        "checked": false,
        "user_added": false,
        "description": "He makes seeing your friends so emotionally expensive that you stop paying the price.",
        "example": "You decline a coffee date because you know he will grill you for hours about what was said."
      },
      {
        "ref": "O-FA8",
        "text": "Acting overly protective of him because fear replaces logic",
        "checked": false,
        "user_added": false,
        "description": "He manipulates you into protecting your captor, making you fear his downfall more than your own pain.",
        "example": "You beg the neighbors not to call the police because you are terrified of what he will do if he gets in trouble."
      },
      {
        "ref": "O-FA9",
        "text": "Avoiding confrontation even when harmed",
        "checked": false,
        "user_added": false,
        "description": "He has taught you that standing up for yourself only leads to worse punishment.",
        "example": "He insults you in public, and you smile and look down instead of defending yourself."
      },
      {
        "ref": "O-FA10",
        "text": "Acting confused or distressed when asked direct questions",
        "checked": false,
        "user_added": false,
        "description": "He keeps you in a state of fog so that simple questions feel like traps.",
        "example": "When asked 'What do you want to do?', you panic because you've forgotten how to want things."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-FB1",
        "text": "She avoids conversations that might reveal inconsistencies in his story.",
        "checked": false,
        "user_added": false,
        "description": "You step around the truth to keep your world from falling apart.",
        "example": "You change the subject when someone asks about his job, knowing his lies won't hold up to scrutiny."
      },
      {
        "ref": "V-F2",
        "text": "She becomes visibly anxious when asked about him.",
        "checked": false,
        "user_added": false,
        "description": "Your body reacts to the threat he represents even when he isn't there.",
        "example": "You start fidgeting and your breathing shallows when your mom asks how things are going at home."
      },
      {
        "ref": "V-FB3",
        "text": "She freezes or shuts down emotionally instead of answering.",
        "checked": false,
        "user_added": false,
        "description": "Your brain goes offline to protect you from the stress of the question.",
        "example": "You stare blankly at a friend who asks why you stayed, unable to find the words."
      },
      {
        "ref": "V-FB4",
        "text": "She acts protective of him as a way to avoid emotional consequences.",
        "checked": false,
        "user_added": false,
        "description": "You are appeasing the giant to keep him from waking up and crushing you.",
        "example": "You insist he 'works hard' to excuse his temper, hoping that if you praise him, he will be kind."
      },
      {
        "ref": "V-FB5",
        "text": "She withdraws when she feels pressured to see the truth.",
        "checked": false,
        "user_added": false,
        "description": "The truth hurts too much right now, so you pull away from the light.",
        "example": "You stop seeing a therapist who gently points out his abuse."
      },
      {
        "ref": "V-FB6",
        "text": "She deflects, changes topics, or gets irritated when you bring up his behavior.",
        "checked": false,
        "user_added": false,
        "description": "You fight the people trying to help because their help feels like an attack on your survival strategy.",
        "example": "You snap at your sister for asking about your finances, telling her to mind her own business."
      },
      {
        "ref": "V-FB7",
        "text": "She shows panic-like reactions to normal emotional conflict.",
        "checked": false,
        "user_added": false,
        "description": "You have been conditioned to expect war, so even a small disagreement feels like a bomb threat.",
        "example": "You burst into tears when a friend gently cancels plans, fearing she hates you now."
      },
      {
        "ref": "V-FB8",
        "text": "She avoids you when she fears you might confront the truth.",
        "checked": false,
        "user_added": false,
        "description": "Shame keeps you hiding; you don't want to see the pity or worry in their eyes.",
        "example": "You ghost your best friend after a bad fight with him because you can't bear to admit what happened."
      },
      {
        "ref": "V-FB9",
        "text": "She experiences emotional paralysis when torn between you and him.",
        "checked": false,
        "user_added": false,
        "description": "You are stuck between the person who loves you and the person who controls you.",
        "example": "You sit by the phone, unable to call your parents or answer his text, frozen in the middle."
      },
      {
        "ref": "V-FB10",
        "text": "She appears to be in mental conflict but shuts down rather than resolving it.",
        "checked": false,
        "user_added": false,
        "description": "The internal war is exhausting, so you surrender to the silence.",
        "example": "You look like you are about to speak the truth, then shake your head and say, 'Never mind.'"
      }
    ]
  },
  "IdentityErosion": {
    "title": "Identity Erosion and Self-Concept Collapse",
    "intro": "This section explores how a person’s sense of self can shift or weaken over time.",
    "description": "When someone is exposed to repeated confusion, pressure, or emotional unpredictability, parts of their identity can become less stable. Preferences, confidence, boundaries, and self-trust may fade without noticing. This section highlights subtle ways a person’s identity can be worn down by prolonged emotional strain.",
    "offender_behavior": [
      {
        "ref": "O-IA1",
        "text": "She slowly loses her sense of self",
        "checked": false,
        "user_added": false,
        "description": "He systematically chips away at her personality until only the parts that serve him remain.",
        "example": "He criticizes your hobbies until you abandon them, leaving you with nothing that is 'yours'."
      },
      {
        "ref": "O-IA2",
        "text": "Her values shift to align with his influence",
        "checked": false,
        "user_added": false,
        "description": "He forces his worldview onto you, making you adopt beliefs you used to disagree with.",
        "example": "You used to value independence, but now you parrot his belief that 'couples should do everything together'."
      },
      {
        "ref": "O-IA3",
        "text": "She becomes emotionally inconsistent",
        "checked": false,
        "user_added": false,
        "description": "He destabilizes your core, causing your emotions to fluctuate wildly as you try to find footing.",
        "example": "You laugh one minute and cry the next, unsure of what you actually feel."
      },
      {
        "ref": "O-IA4",
        "text": "She experiences guilt or shame for wanting independence",
        "checked": false,
        "user_added": false,
        "description": "He has trained you to view autonomy as selfishness.",
        "example": "You feel like a bad person for wanting to go for a walk alone."
      },
      {
        "ref": "O-IA5",
        "text": "She loses access to her normal emotions",
        "checked": false,
        "user_added": false,
        "description": "He demands you suppress anything that inconveniences him, leaving you numb.",
        "example": "You can't remember the last time you felt genuine, carefree joy."
      },
      {
        "ref": "O-IA6",
        "text": "She distrusts her own memories",
        "checked": false,
        "user_added": false,
        "description": "He gaslights you until you view your own mind as a broken instrument.",
        "example": "You write things down to prove they happened, because you no longer trust your brain."
      },
      {
        "ref": "O-IA7",
        "text": "Her emotional reactions no longer match her personality",
        "checked": false,
        "user_added": false,
        "description": "The stress turns you into someone you don't recognize.",
        "example": "You are normally patient, but now you snap at strangers because your nerves are fried."
      },
      {
        "ref": "O-IA8",
        "text": "She becomes passive when she used to be strong",
        "checked": false,
        "user_added": false,
        "description": "He has beaten the fight out of you through relentless attrition.",
        "example": "You used to lead projects at work, but now you sit silently and let others decide."
      },
      {
        "ref": "O-IA9",
        "text": "She adopts the abuser's viewpoint as her own",
        "checked": false,
        "user_added": false,
        "description": "Survival involves merging with the aggressor to anticipate his needs.",
        "example": "You start disliking the friends he dislikes, adopting his prejudices."
      },
      {
        "ref": "O-IA10",
        "text": "She begins to act as a different version of herself entirely",
        "checked": false,
        "user_added": false,
        "description": "He has created a 'construct' of you that he likes, and you inhabit it to survive.",
        "example": "You dress, speak, and act like the woman he wants, burying the real you deep inside."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-IB1",
        "text": "She behaves like a reduced or muted version of herself.",
        "checked": false,
        "user_added": false,
        "description": "You are shrinking to take up less space, hoping to avoid being a target.",
        "example": "You speak in a whisper and avoid eye contact, fading into the background."
      },
      {
        "ref": "V-IB2",
        "text": "She loses confidence in her ability to make decisions.",
        "checked": false,
        "user_added": false,
        "description": "You have been told you are wrong so many times that you believe you are incapable.",
        "example": "You ask him permission to buy groceries because you fear buying the wrong thing."
      },
      {
        "ref": "V-IB3",
        "text": "She shows emotional numbness where passion used to be.",
        "checked": false,
        "user_added": false,
        "description": "Your fire has been doused to keep the peace; numbness is safer than feeling.",
        "example": "You used to love painting, but now you look at the canvas and feel nothing."
      },
      {
        "ref": "V-IB4",
        "text": "She aligns her opinions with his, even if they contradict her core personality.",
        "checked": false,
        "user_added": false,
        "description": "Agreeing is a defense mechanism, not a genuine change of heart.",
        "example": "You nod along when he mocks your political beliefs, just to make the conversation stop."
      },
      {
        "ref": "V-IB5",
        "text": "She absorbs blame for things she didn't do because she's lost her internal compass.",
        "checked": false,
        "user_added": false,
        "description": "You have lost the boundary between his responsibility and yours.",
        "example": "You apologize for the rain ruining his plans, feeling genuinely guilty."
      },
      {
        "ref": "V-IB6",
        "text": "She redefines her identity around what keeps her emotionally safe with him.",
        "checked": false,
        "user_added": false,
        "description": "Your 'self' is now structured around his needs, not yours.",
        "example": "You define yourself as 'his partner' first, and an individual second."
      },
      {
        "ref": "V-IB7",
        "text": "She becomes emotionally fragile or volatile under pressure.",
        "checked": false,
        "user_added": false,
        "description": "You are living at your limit; there is no buffer left for stress.",
        "example": "Spilling a cup of tea makes you break down in hysterical tears."
      },
      {
        "ref": "V-IB8",
        "text": "She expresses confusion about who she is or what she wants.",
        "checked": false,
        "user_added": false,
        "description": "The connection to your inner self has been severed.",
        "example": "You say, 'I don't know what I like anymore,' and truly mean it."
      },
      {
        "ref": "V-IB9",
        "text": "She normalizes mistreatment because her internal reference points eroded.",
        "checked": false,
        "user_added": false,
        "description": "You have forgotten what healthy treatment feels like.",
        "example": "You tell friends, 'He's not that bad, he didn't hit me,' accepting the bare minimum."
      },
      {
        "ref": "V-IB10",
        "text": "She feels disconnected from her past self, as if she became someone else.",
        "checked": false,
        "user_added": false,
        "description": "Trauma splits time into 'before' and 'after,' leaving the old you behind.",
        "example": "You look at old photos and think, 'I don't know that girl anymore.'"
      }
    ]
  },
  "TraumaBondCycle": {
    "title": "Trauma Bond Cycle",
    "intro": "This section describes a pattern where strong emotional highs and lows create a powerful attachment.",
    "description": "Trauma bonds form when periods of stress, conflict, or fear are mixed with moments of comfort, closeness, or relief. The contrast strengthens the attachment because the nervous system links the other person to safety. This section outlines how repeated cycles of tension and reassurance can create a bond that feels difficult to break.",
    "offender_behavior": [
      {
        "ref": "O-TB1",
        "text": "Relief after stress becomes addictive and controlling",
        "checked": false,
        "user_added": false,
        "description": "He creates the pain so that he can be the one to relieve it, making you grateful for the cessation of abuse.",
        "example": "He screams at you for hours, then hugs you. You feel an immense rush of gratitude for the hug, forgetting he caused the fear."
      },
      {
        "ref": "O-TB2",
        "text": "Cycle of chaos → guilt → relief → connection",
        "checked": false,
        "user_added": false,
        "description": "He traps you in a loop where the only way out of the chaos he created is through him.",
        "example": "He starts a fight (chaos), blames you (guilt), accepts your apology (relief), and then acts loving (connection)."
      },
      {
        "ref": "O-TB3",
        "text": "Emotional highs and lows become tied to the abuser",
        "checked": false,
        "user_added": false,
        "description": "He becomes the regulator of your dopamine and cortisol, chemically addicting you to the relationship.",
        "example": "You feel dead inside until he texts you, which gives you a sudden spike of euphoria."
      },
      {
        "ref": "O-TB4",
        "text": "Fear and comfort coming from the same source",
        "checked": false,
        "user_added": false,
        "description": "He confuses your biological attachment system by being both the monster and the protector.",
        "example": "He scares you with reckless driving, then holds your hand to 'calm you down' when he stops."
      },
      {
        "ref": "O-TB5",
        "text": "Intermittent reinforcement shaping loyalty",
        "checked": false,
        "user_added": false,
        "description": "He gives kindness unpredictably, like a slot machine, keeping you hooked waiting for the next win.",
        "example": "He is cold for weeks, then suddenly plans a romantic date, making you think things are finally changing."
      },
      {
        "ref": "O-T6",
        "text": "The abuser acts warm only after causing harm",
        "checked": false,
        "user_added": false,
        "description": "He uses warmth as a bandage to cover the wound he just inflicted, preventing you from leaving.",
        "example": "After making you cry, he wipes your tears and tells you he loves you more than anyone."
      },
      {
        "ref": "O-T7",
        "text": "Victim craves reassurance from the source of the distress",
        "checked": false,
        "user_added": false,
        "description": "He positions himself so that he is the only one who can fix the way you feel.",
        "example": "He makes you feel worthless, so you beg him to tell you that you are good enough."
      },
      {
        "ref": "O-T8",
        "text": "Feeling bonded to the abuser despite harm",
        "checked": false,
        "user_added": false,
        "description": "He exploits your biological drive to bond, twisting it so you bond deeper through shared 'intensity'.",
        "example": "You feel like you've 'been through war together,' mistaking abuse for a shared struggle."
      },
      {
        "ref": "O-T9",
        "text": "Difficulty explaining why leaving feels impossible",
        "checked": false,
        "user_added": false,
        "description": "He has created a psychological addiction that logic cannot easily break.",
        "example": "You know he is bad for you, but the thought of leaving makes you physically ill."
      },
      {
        "ref": "O-T10",
        "text": "Sense of emotional withdrawal when apart from the abuser",
        "checked": false,
        "user_added": false,
        "description": "He has conditioned your body to need his presence, even if that presence is toxic.",
        "example": "You feel shaky and anxious when you haven't heard from him, like an addict needing a fix."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-T1",
        "text": "She becomes attached to moments of relief he provides, mistaking them for love or safety.",
        "checked": false,
        "user_added": false,
        "description": "You are starving for kindness; when he gives you crumbs, it feels like a feast.",
        "example": "You cherish the one night he didn't yell, viewing it as proof he is a good man."
      },
      {
        "ref": "V-T2",
        "text": "She experiences emotional withdrawal when he is absent, similar to addiction.",
        "checked": false,
        "user_added": false,
        "description": "Your body has been chemically rewired by the stress cycle; you physically crave the resolution he offers.",
        "example": "You can't focus on anything else until you know where he is and what mood he's in."
      },
      {
        "ref": "V-T3",
        "text": "She defends him because her body associates him with relief after fear.",
        "checked": false,
        "user_added": false,
        "description": "Your biology betrays you, remembering the comfort of the makeup more than the pain of the fight.",
        "example": "You tell friends, 'He's so sweet when we make up,' forgetting the cruelty that required the makeup."
      },
      {
        "ref": "V-T4",
        "text": "She feels bonded to him even while recognizing logically that he is harmful.",
        "checked": false,
        "user_added": false,
        "description": "Trauma bonding is not stupidity; it is a powerful survival instinct gone wrong.",
        "example": "You write lists of why you should leave, but your heart refuses to let go."
      },
      {
        "ref": "V-T5",
        "text": "She seeks emotional reconciliation after conflict, believing it restores connection.",
        "checked": false,
        "user_added": false,
        "description": "You want the pain to stop, and he has taught you that submission is the only button that stops it.",
        "example": "You apologize for things you didn't do just to get him to hug you again."
      },
      {
        "ref": "V-T6",
        "text": "She interprets the absence of chaos as affection from him.",
        "checked": false,
        "user_added": false,
        "description": "Your bar is so low that mere peace feels like love.",
        "example": "You think he had a 'great day' just because he didn't insult you."
      },
      {
        "ref": "V-T7",
        "text": "She becomes confused when emotional stability comes from outside the bond.",
        "checked": false,
        "user_added": false,
        "description": "Normal interactions feel boring or suspicious because you are used to high-stakes intensity.",
        "example": "A friend is kind to you without strings attached, and you don't know how to react."
      },
      {
        "ref": "V-T8",
        "text": "She returns emotionally to the abuser because calm moments feel like 'proof' he cares.",
        "checked": false,
        "user_added": false,
        "description": "You cling to the potential of who he could be, rather than the reality of who he is.",
        "example": "You go back to him because he cried and said he needed you, believing this time will be different."
      },
      {
        "ref": "V-T9",
        "text": "She feels responsible for maintaining the bond at all costs.",
        "checked": false,
        "user_added": false,
        "description": "He has burdened you with the task of keeping the relationship alive.",
        "example": "You exhaust yourself trying to be perfect so he won't have a reason to leave."
      },
      {
        "ref": "V-T10",
        "text": "She believes leaving the abuser will cause unbearable emotional distress.",
        "checked": false,
        "user_added": false,
        "description": "The bond makes the unknown terrifying; staying in hell feels safer than stepping into the void.",
        "example": "You stay because the thought of a life without him feels like dying."
      }
    ]
  },
  "DecisionMakingBreakdown": {
    "title": "Decision-Making Breakdown",
    "intro": "This section focuses on how emotional pressure can affect clarity and decision-making.",
    "description": "Stress, confusion, guilt, and emotional exhaustion can make it hard to make confident decisions. A person may doubt themselves, overthink simple choices, or feel frozen when faced with conflict. This section highlights how decision-making can become unstable when someone feels overwhelmed or emotionally controlled.",
    "offender_behavior": [
      {
        "ref": "O-DA1",
        "text": "Inability to make independent decisions",
        "checked": false,
        "user_added": false,
        "description": "He has conditioned you to fear your own agency, making you dependent on him for direction.",
        "example": "He criticizes your choices so often that you stop making them altogether."
      },
      {
        "ref": "O-DA2",
        "text": "Decisions based on avoiding emotional consequences",
        "checked": false,
        "user_added": false,
        "description": "He trains you to choose what is safe for him, not what is good for you.",
        "example": "You choose the movie he likes to avoid him sulking for the rest of the night."
      },
      {
        "ref": "O-DA3",
        "text": "Highly inconsistent or contradictory choices",
        "checked": false,
        "user_added": false,
        "description": "He creates a chaotic environment where the rules constantly change, scrambling your decision-making.",
        "example": "He demands you spend less money, then gets angry when you don't buy the expensive steak he wanted."
      },
      {
        "ref": "O-DA4",
        "text": "Difficulty thinking logically under stress",
        "checked": false,
        "user_added": false,
        "description": "He keeps you in a state of high arousal where your logical brain cannot function.",
        "example": "He screams questions at you so fast that you can't think, causing you to agree to things you don't want."
      },
      {
        "ref": "O-DA5",
        "text": "Freeze responses when a decision would upset the abuser",
        "checked": false,
        "user_added": false,
        "description": "He has linked autonomy with punishment, so your brain hits the brakes whenever you try to choose for yourself.",
        "example": "You stare at the menu for twenty minutes, terrified of ordering something he will mock."
      },
      {
        "ref": "O-DA6",
        "text": "Seeking reassurance from the abuser before acting",
        "checked": false,
        "user_added": false,
        "description": "He has made himself the gatekeeper of your reality.",
        "example": "You ask, 'Is it okay if I wear this?' before leaving the house."
      },
      {
        "ref": "O-DA7",
        "text": "Avoiding decisions to prevent emotional conflict",
        "checked": false,
        "user_added": false,
        "description": "He has taught you that passivity is the only way to avoid a fight.",
        "example": "You let him pick the vacation spot because discussing it always leads to an argument."
      },
      {
        "ref": "O-DA8",
        "text": "Feeling overwhelmed by simple choices",
        "checked": false,
        "user_added": false,
        "description": "He has depleted your cognitive energy, making small molehills feel like mountains.",
        "example": "Deciding what to cook for dinner feels like a life-or-death calculation."
      },
      {
        "ref": "O-DA9",
        "text": "Loss of ability to prioritize personal needs",
        "checked": false,
        "user_added": false,
        "description": "He has trained you to put yourself last, every single time.",
        "example": "You skip your doctor's appointment to run an errand for him."
      },
      {
        "ref": "O-DA10",
        "text": "Decisions driven by fear or guilt instead of desire",
        "checked": false,
        "user_added": false,
        "description": "He manipulates your emotions so that you act out of obligation, not free will.",
        "example": "You have sex with him not because you want to, but because you feel guilty saying no."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-DB1",
        "text": "She becomes paralyzed when having to choose between what she wants and what he wants.",
        "checked": false,
        "user_added": false,
        "description": "You are trapped in a bind where winning for yourself means losing his approval.",
        "example": "You freeze when asked where to eat, terrified of picking the 'wrong' place."
      },
      {
        "ref": "V-DB2",
        "text": "She second-guesses herself constantly and feels unsure about even small decisions.",
        "checked": false,
        "user_added": false,
        "description": "Your internal confidence has been eroded; you don't trust your own gut anymore.",
        "example": "You change your outfit five times, wondering which one will make him least angry."
      },
      {
        "ref": "V-DB3",
        "text": "She avoids making choices because she fears emotional consequences from him.",
        "checked": false,
        "user_added": false,
        "description": "You have learned that making a choice is making a mistake.",
        "example": "You say 'I don't care' to everything, forcing him to choose so you can't be blamed."
      },
      {
        "ref": "V-DB4",
        "text": "She contradicts previous decisions because her emotional state is unstable.",
        "checked": false,
        "user_added": false,
        "description": "You are reacting to the shifting sands of his mood, not your own consistent desires.",
        "example": "You say you want to leave, then an hour later say you want to stay, because he scared you back into submission."
      },
      {
        "ref": "V-DB5",
        "text": "She adopts whatever viewpoint causes the least emotional conflict.",
        "checked": false,
        "user_added": false,
        "description": "You are a chameleon for survival, blending in to avoid being attacked.",
        "example": "You agree that his rude friend is actually 'funny' just to avoid a debate."
      },
      {
        "ref": "V-DB6",
        "text": "She defers important decisions to him or his influence.",
        "checked": false,
        "user_added": false,
        "description": "You have handed over the steering wheel of your life because he made you feel like a bad driver.",
        "example": "You let him decide how to spend your bonus check."
      },
      {
        "ref": "V-DB7",
        "text": "She becomes overwhelmed by normal decision-making processes.",
        "checked": false,
        "user_added": false,
        "description": "Your brain is exhausted from threat detection; it has no power left for logistics.",
        "example": "You cry because you can't decide which route to drive to work."
      },
      {
        "ref": "V-DB8",
        "text": "She changes decisions suddenly when she senses his disapproval.",
        "checked": false,
        "user_added": false,
        "description": "You are hyper-attuned to his micro-expressions and adjust course immediately.",
        "example": "You order a salad instead of the burger you wanted because he raised an eyebrow."
      },
      {
        "ref": "V-DB9",
        "text": "She feels guilt or shame when making independent decisions.",
        "checked": false,
        "user_added": false,
        "description": "He has wired your brain to associate autonomy with selfishness.",
        "example": "You feel like a traitor for buying a new pair of shoes without asking him."
      },
      {
        "ref": "V-DB10",
        "text": "She makes choices that prioritize his emotional comfort over her own well-being.",
        "checked": false,
        "user_added": false,
        "description": "You set yourself on fire to keep him warm.",
        "example": "You stop taking your medication because he says it changes your personality."
      }
    ]
  },
  "CognitiveDistortionPatterns": {
    "title": "Cognitive Distortion Patterns",
    "intro": "This section explains how thinking patterns can shift under emotional stress.",
    "description": "Ongoing emotional pressure can change how someone interprets situations, memories, or themselves. They may blame themselves, minimise what happened, or believe things that contradict their usual values. These shifts are not intentional—they’re survival responses. This section explores how prolonged stress shapes thought patterns.",
    "offender_behavior": [
      {
        "ref": "O-G1",
        "text": "Victim adopts distorted beliefs introduced by the abuser",
        "checked": false,
        "user_added": false,
        "description": "He plants lies about you in your mind until they grow into your own beliefs.",
        "example": "He tells you repeatedly that you are 'bad with money' until you surrender your finances to him."
      },
      {
        "ref": "O-G2",
        "text": "Memory confusion triggered by gaslighting",
        "checked": false,
        "user_added": false,
        "description": "He actively messes with your timeline and facts to make you doubt your sanity.",
        "example": "He denies an event happened, even though you have photos of it, making you question reality."
      },
      {
        "ref": "O-G3",
        "text": "All-or-nothing thinking influenced by emotional manipulation",
        "checked": false,
        "user_added": false,
        "description": "He forces you into a world of extremes where you are either 'perfect' or 'worthless.'",
        "example": "He tells you that one mistake ruins the entire relationship."
      },
      {
        "ref": "O-G4",
        "text": "Believing she is responsible for his actions or emotions",
        "checked": false,
        "user_added": false,
        "description": "He outsources his emotional regulation to you, making his anger your fault.",
        "example": "He says, 'Look what you made me do,' after punching a wall."
      },
      {
        "ref": "O-G5",
        "text": "Feeling guilty for things she did not do",
        "checked": false,
        "user_added": false,
        "description": "He fabricates accusations to keep you on the defensive.",
        "example": "He accuses you of flirting with the waiter, and you apologize for it."
      },
      {
        "ref": "O-G6",
        "text": "Distorted interpretations of past events",
        "checked": false,
        "user_added": false,
        "description": "He reframes history to make him the hero and you the villain.",
        "example": "He claims he 'saved' you from your family, when in reality he isolated you from them."
      },
      {
        "ref": "O-G7",
        "text": "Believing she 'deserves' mistreatment",
        "checked": false,
        "user_added": false,
        "description": "He convinces you that abuse is the natural consequence of your flaws.",
        "example": "He says, 'I wouldn't have to yell if you just listened,' and you believe him."
      },
      {
        "ref": "O-G8",
        "text": "Internalizing blame and shame",
        "checked": false,
        "user_added": false,
        "description": "He projects his shame onto you, and you carry it for him.",
        "example": "You feel ashamed of his public outbursts, as if they reflect on you."
      },
      {
        "ref": "O-G9",
        "text": "Minimizing harmful behavior because he reframed it",
        "checked": false,
        "user_added": false,
        "description": "He uses soft words for hard actions to lower your defenses.",
        "example": "He calls his possessiveness 'passion' and his insults 'jokes'."
      },
      {
        "ref": "O-G10",
        "text": "Rewriting her moral compass to match his influence",
        "checked": false,
        "user_added": false,
        "description": "He warps your sense of right and wrong to serve his needs.",
        "example": "He convinces you that lying to your parents is the 'right' thing to do to protect the relationship."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-G1",
        "text": "She doubts her own memory and asks others what 'really' happened.",
        "checked": false,
        "user_added": false,
        "description": "You have lost faith in your own mind's ability to record reality.",
        "example": "You ask a friend, 'Was he really shouting, or was I overreacting?'"
      },
      {
        "ref": "V-G2",
        "text": "She adopts the abuser's explanation of events even when it contradicts reality.",
        "checked": false,
        "user_added": false,
        "description": "It is easier to accept his lie than to live in the tension of the truth.",
        "example": "You agree that you provoked him, even though you know you were sitting silently."
      },
      {
        "ref": "V-G3",
        "text": "She blames herself for things that were clearly outside her control.",
        "checked": false,
        "user_added": false,
        "description": "You are taking responsibility for the universe just to feel a sense of control.",
        "example": "You blame yourself for the traffic jam that made him late."
      },
      {
        "ref": "V-G4",
        "text": "She believes she caused problems she had no part in.",
        "checked": false,
        "user_added": false,
        "description": "His accusation creates your guilt, regardless of the facts.",
        "example": "You feel guilty for his bad mood before you've even spoken to him."
      },
      {
        "ref": "V-G5",
        "text": "She minimizes the abuser's harmful actions, calling them misunderstandings or stress.",
        "checked": false,
        "user_added": false,
        "description": "You are protecting the relationship by shrinking the abuse.",
        "example": "You say, 'He didn't mean to push me, he was just rushing past.'"
      },
      {
        "ref": "V-G6",
        "text": "She interprets manipulation as concern or care.",
        "checked": false,
        "user_added": false,
        "description": "You want to be loved so badly that you accept control as a substitute.",
        "example": "You think his demand to track your location is just him 'worrying' about you."
      },
      {
        "ref": "V-G7",
        "text": "She excuses his behavior with reasons he gave her, not her own experiences.",
        "checked": false,
        "user_added": false,
        "description": "You are reciting his script to explain away your pain.",
        "example": "You say, 'He has a temper because of his difficult childhood,' as if that makes it okay."
      },
      {
        "ref": "V-G8",
        "text": "She accepts blame because she cannot mentally hold the idea that he is harming her.",
        "checked": false,
        "user_added": false,
        "description": "The truth that he is dangerous is too scary, so you choose the lie that you are the problem.",
        "example": "You think, 'If I just fix myself, he will be nice again.'"
      },
      {
        "ref": "V-G9",
        "text": "She reframes events through his wording, not her memory.",
        "checked": false,
        "user_added": false,
        "description": "His language has overwritten your own perception.",
        "example": "You call a terrifying rage incident a 'heated discussion' because that's what he called it."
      },
      {
        "ref": "V-G10",
        "text": "She believes emotional abuse is 'normal' or 'not that bad' because he reframed it.",
        "checked": false,
        "user_added": false,
        "description": "Your baseline for normal has been moved into the basement.",
        "example": "You think being yelled at daily is just 'how relationships work'."
      }
    ]
  },
  "DependencyFormation": {
    "title": "Dependency Formation",
    "intro": "This section examines how emotional or practical dependency can develop gradually.",
    "description": "A person may begin relying on someone else for stability, reassurance, decision-making, or emotional grounding. This can happen through isolation, stress, inconsistent affection, or repeated crises. This section shows how dependency forms over time, often without the person realising it.",
    "offender_behavior": [
      {
        "ref": "O-DPA1",
        "text": "Abuser positions himself as the only stable emotional source",
        "checked": false,
        "user_added": false,
        "description": "He creates a storm and then sells himself as the only shelter.",
        "example": "He creates drama with your friends, then comforts you, making you feel he is the only one who cares."
      },
      {
        "ref": "O-DPA2",
        "text": "Victim becomes reliant on him during distress",
        "checked": false,
        "user_added": false,
        "description": "He ensures that when you fall, you land in his arms, cementing his role as savior.",
        "example": "He undermines your confidence at work so you come home crying to him for validation."
      },
      {
        "ref": "O-DPA3",
        "text": "He becomes the validator of her emotions",
        "checked": false,
        "user_added": false,
        "description": "He trains you to look at him to check if your feelings are 'correct'.",
        "example": "You stop trusting your anger until he agrees that you have a right to be angry."
      },
      {
        "ref": "O-DPA4",
        "text": "He uses vulnerability to establish emotional roles",
        "checked": false,
        "user_added": false,
        "description": "He exploits your open heart to insert his control mechanisms.",
        "example": "He uses the secrets you told him in confidence to humiliate you later."
      },
      {
        "ref": "O-DPA5",
        "text": "He plants seeds of doubt to weaken her independence",
        "checked": false,
        "user_added": false,
        "description": "He whispers insecurity into your ear until you are too afraid to stand alone.",
        "example": "He says, 'Are you sure you can handle that job? It seems too hard for you.'"
      },
      {
        "ref": "O-DPA6",
        "text": "Victim loses confidence in managing life without him",
        "checked": false,
        "user_added": false,
        "description": "He infantilizes you until you feel like a child in a complex world.",
        "example": "He handles all the bills and paperwork, so you feel helpless when a letter arrives."
      },
      {
        "ref": "O-DPA7",
        "text": "Abuser offers 'help' he strategically created the need for",
        "checked": false,
        "user_added": false,
        "description": "He breaks your leg just so he can offer you a crutch.",
        "example": "He sabotages your car, then rides in like a hero to drive you to work."
      },
      {
        "ref": "O-DPA8",
        "text": "Victim believes only he understands her",
        "checked": false,
        "user_added": false,
        "description": "He creates a cult of two, convincing you the outside world just doesn't 'get' you.",
        "example": "He says, 'No one loves you like I do,' implying others love you less."
      },
      {
        "ref": "O-DPA9",
        "text": "Victim feels insecure without his reassurance",
        "checked": false,
        "user_added": false,
        "description": "He has become your mirror; without him, you don't know what you look like.",
        "example": "You need him to tell you you look pretty before you can believe it."
      },
      {
        "ref": "O-DPA10",
        "text": "Victim avoids upsetting him out of emotional dependence",
        "checked": false,
        "user_added": false,
        "description": "You protect the bond at all costs because the bond is your lifeline.",
        "example": "You swallow your pride and apologize just to keep him from withdrawing his support."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-DPB1",
        "text": "She contacts him first during emotional distress because he conditioned her to.",
        "checked": false,
        "user_added": false,
        "description": "He has trained you to run to the source of your pain for comfort.",
        "example": "He yells at you, and your first instinct is to call him and beg for forgiveness."
      },
      {
        "ref": "V-DPB2",
        "text": "She believes he is the only one who understands or supports her.",
        "checked": false,
        "user_added": false,
        "description": "You have bought into the 'us against the world' lie.",
        "example": "You stop talking to friends because you think they 'just don't understand our love'."
      },
      {
        "ref": "V-DPB3",
        "text": "She feels emotionally unsafe when he is not available.",
        "checked": false,
        "user_added": false,
        "description": "Your sense of security is entirely externalized onto him.",
        "example": "You panic if he doesn't answer his phone, feeling exposed and vulnerable."
      },
      {
        "ref": "V-DPB4",
        "text": "She makes life choices based on how it will affect his feelings.",
        "checked": false,
        "user_added": false,
        "description": "You are living his life, not yours.",
        "example": "You turn down a girls' trip because you know he will feel lonely."
      },
      {
        "ref": "V-DPB5",
        "text": "She struggles to imagine her life without him, despite harm.",
        "checked": false,
        "user_added": false,
        "description": "He has woven himself so deeply into your psyche that removing him feels like amputation.",
        "example": "You think, 'I'd rather be miserable with him than happy alone.'"
      },
      {
        "ref": "V-DPB6",
        "text": "She views his influence as necessary or protective.",
        "checked": false,
        "user_added": false,
        "description": "You mistake his cage for a shield.",
        "example": "You think his jealousy protects you from bad men, not realizing he is the bad man."
      },
      {
        "ref": "V-DPB7",
        "text": "She adjusts her emotions based on his reactions.",
        "checked": false,
        "user_added": false,
        "description": "You are emotionally tethered to him; you rise and fall with his tide.",
        "example": "You are having a great day until he frowns, and then your mood instantly crashes."
      },
      {
        "ref": "V-DPB8",
        "text": "She hides her feelings from others to protect the bond with him.",
        "checked": false,
        "user_added": false,
        "description": "You are curating a fake reality for the outside world.",
        "example": "You smile and say 'Everything is great' while holding back tears."
      },
      {
        "ref": "V-DPB9",
        "text": "She suppresses her independence to maintain harmony.",
        "checked": false,
        "user_added": false,
        "description": "You trade your freedom for a false sense of peace.",
        "example": "You stop driving your own car so you don't have to argue about gas money."
      },
      {
        "ref": "V-DPB10",
        "text": "She experiences emotional distress when distancing from him, even temporarily.",
        "checked": false,
        "user_added": false,
        "description": "Separation anxiety is a symptom of the trauma bond.",
        "example": "You feel a physical ache in your chest when he goes to work."
      }
    ]
  },
  "EmotionalWithdrawalControl": {
    "title": "Emotional Withdrawal as Control",
    "intro": "This section looks at how emotional distance can be used to influence someone’s behaviour.",
    "description": "Emotional withdrawal—sudden coldness, silence, detachment, or distance—can create fear of losing connection. This can lead someone to change their behaviour to regain closeness or avoid conflict. This section explains how emotional withdrawal shapes responses and stability in a relationship.",
    "offender_behavior": [
      {
        "ref": "O-EWA1",
        "text": "Abuser becomes cold or distant to punish the victim",
        "checked": false,
        "user_added": false,
        "description": "He uses the 'silent treatment' as a whip to discipline you.",
        "example": "He stares through you like you're a ghost because you forgot to do the laundry."
      },
      {
        "ref": "O-EWA2",
        "text": "He withdraws affection to reinforce obedience",
        "checked": false,
        "user_added": false,
        "description": "He treats love as a currency that you have to earn.",
        "example": "He pulls away from a hug because he's 'not in the mood' after you disagreed with him."
      },
      {
        "ref": "O-EWA3",
        "text": "Victim becomes anxious when he pulls away",
        "checked": false,
        "user_added": false,
        "description": "He knows his distance causes you panic, and he uses that panic to control you.",
        "example": "He sees you checking your phone desperately and deliberately waits hours to reply."
      },
      {
        "ref": "O-EWA4",
        "text": "He uses silence as a form of punishment",
        "checked": false,
        "user_added": false,
        "description": "His silence is loud; it creates a vacuum you scramble to fill.",
        "example": "He refuses to answer your questions, forcing you to talk to yourself to fill the void."
      },
      {
        "ref": "O-EWA5",
        "text": "Victim chases connection to restore emotional stability",
        "checked": false,
        "user_added": false,
        "description": "He plays hard to get so that you have to work hard to keep him.",
        "example": "He walks away during an argument, knowing you will follow him begging to talk."
      },
      {
        "ref": "O-EWA6",
        "text": "He gives affection only when she complies",
        "checked": false,
        "user_added": false,
        "description": "He trains you like a dog; good behavior gets a treat, bad behavior gets ignored.",
        "example": "He is only affectionate after you admit you were 'wrong' and he was 'right'."
      },
      {
        "ref": "O-EWA7",
        "text": "Victim experiences fear when connection feels unstable",
        "checked": false,
        "user_added": false,
        "description": "He keeps the foundation shaky so you are always afraid of falling.",
        "example": "You feel sick when his tone changes, anticipating the freeze-out."
      },
      {
        "ref": "O-EWA8",
        "text": "He creates emotional scarcity so she values small affection",
        "checked": false,
        "user_added": false,
        "description": "He starves you of love so that a crumb feels like a loaf of bread.",
        "example": "He is so rarely kind that when he holds the door for you, you weep with gratitude."
      },
      {
        "ref": "O-EWA9",
        "text": "He deliberately withholds reassurance",
        "checked": false,
        "user_added": false,
        "description": "He sees your insecurity and refuses to soothe it, keeping you off balance.",
        "example": "You ask if he still loves you, and he shrugs or changes the subject."
      },
      {
        "ref": "O-EWA10",
        "text": "Victim becomes conditioned to avoid conflict",
        "checked": false,
        "user_added": false,
        "description": "He has taught you that having a voice equals losing his love.",
        "example": "You swallow your complaints to ensure he keeps smiling."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-EWB1",
        "text": "She becomes anxious or panicked when he emotionally withdraws.",
        "checked": false,
        "user_added": false,
        "description": "His silence triggers your abandonment wounds, sending you into survival mode.",
        "example": "You feel like you can't breathe when he gives you the cold shoulder."
      },
      {
        "ref": "V-EWB2",
        "text": "She tries harder to please him after he becomes distant.",
        "checked": false,
        "user_added": false,
        "description": "You are 'fawning'—trying to be perfect to earn back safety.",
        "example": "You cook his favorite meal and clean the whole house just to get him to look at you."
      },
      {
        "ref": "V-EWB3",
        "text": "She blames herself for his coldness.",
        "checked": false,
        "user_added": false,
        "description": "You assume the problem is you, because that implies you can fix it.",
        "example": "You think, 'I must have been too annoying,' instead of 'He is being manipulative.'"
      },
      {
        "ref": "V-EWB4",
        "text": "She experiences emotional instability based on how warm or cold he is that day.",
        "checked": false,
        "user_added": false,
        "description": "Your emotional weather is entirely dictated by his climate.",
        "example": "You have a knot in your stomach all day because he didn't kiss you goodbye."
      },
      {
        "ref": "V-EWB5",
        "text": "She feels compelled to fix the situation even when she did nothing wrong.",
        "checked": false,
        "user_added": false,
        "description": "You absorb the responsibility for the relationship's harmony.",
        "example": "You apologize for 'being weird' just to break the tension he created."
      },
      {
        "ref": "V-EWB6",
        "text": "She becomes compliant to avoid further emotional withdrawal.",
        "checked": false,
        "user_added": false,
        "description": "Submission feels like the price of connection.",
        "example": "You agree to do what he wants just so he will start talking to you again."
      },
      {
        "ref": "V-EWB7",
        "text": "She interprets his temporary warmth as significant affection.",
        "checked": false,
        "user_added": false,
        "description": "Relief from pain looks like love when you are hurting.",
        "example": "You think he is the best boyfriend ever because he stopped ignoring you."
      },
      {
        "ref": "V-EWB8",
        "text": "She associates affection with relief from anxiety rather than genuine bond.",
        "checked": false,
        "user_added": false,
        "description": "You are addicted to the 'making up' because it ends the torture of the 'breaking down'.",
        "example": "Hugging him feels like taking a deep breath after holding it underwater."
      },
      {
        "ref": "V-EWB9",
        "text": "She cannot emotionally regulate without his validation.",
        "checked": false,
        "user_added": false,
        "description": "He has taken the keys to your emotional car.",
        "example": "You can't stop crying until he tells you it's okay."
      },
      {
        "ref": "V-EWB10",
        "text": "She becomes fearful and emotionally small to avoid triggering withdrawal.",
        "checked": false,
        "user_added": false,
        "description": "You shrink yourself to stay safe.",
        "example": "You become quiet and still, hoping not to disturb the peace."
      }
    ]
  },
  "ShameLoops": {
    "title": "Shame and Guilt Conditioning",
    "intro": "This section focuses on patterns where shame keeps repeating and reinforcing itself.",
    "description": "Shame can be triggered by mistakes, pressure, criticism, or emotional blame. When it repeats, it becomes a loop: the person feels ashamed, tries to fix it, then feels ashamed again. These loops make it hard to think clearly or trust oneself. This section highlights how shame becomes an internal cycle that affects behaviour.",
    "offender_behavior": [
      {
        "ref": "O-SHA1",
        "text": "Abuser uses shame to control decisions",
        "checked": false,
        "user_added": false,
        "description": "He attacks your character instead of your actions to make you feel unworthy.",
        "example": "He says, 'A good mother wouldn't do that,' to force you to comply."
      },
      {
        "ref": "O-SHA2",
        "text": "Victim apologizes for things she didn't do",
        "checked": false,
        "user_added": false,
        "description": "He creates an environment where you are always guilty until proven innocent.",
        "example": "You apologize for the restaurant being closed, as if you closed it."
      },
      {
        "ref": "O-SHA3",
        "text": "Victim feels inadequate in ways she never did before",
        "checked": false,
        "user_added": false,
        "description": "He introduces new insecurities to lower your self-esteem.",
        "example": "He constantly points out 'flaws' in your personality that no one else ever saw."
      },
      {
        "ref": "O-SHA4",
        "text": "Shame becomes an emotional foundation of the bond",
        "checked": false,
        "user_added": false,
        "description": "He connects himself to your sense of worth; you feel 'bad' and he is the judge.",
        "example": "You feel like a naughty child needing his forgiveness to be 'good' again."
      },
      {
        "ref": "O-SHA5",
        "text": "Victim believes she is 'not good enough' without the abuser",
        "checked": false,
        "user_added": false,
        "description": "He convinces you that you are damaged goods and he is doing you a favor by staying.",
        "example": "He says, 'No one else would put up with you,' making you grateful for his abuse."
      },
      {
        "ref": "O-SHA6",
        "text": "Abuser reinforces self-doubt through subtle criticism",
        "checked": false,
        "user_added": false,
        "description": "He uses 'negging'—backhanded compliments—to chip away at your confidence.",
        "example": "He says, 'You look great, for someone your age,' leaving a sting in the praise."
      },
      {
        "ref": "O-SHA7",
        "text": "Victim seeks reassurance from the abuser",
        "checked": false,
        "user_added": false,
        "description": "He breaks your ego so you have to come to him to fix it.",
        "example": "You ask him constantly, 'Are you mad at me?' because you always assume you've messed up."
      },
      {
        "ref": "O-SHA8",
        "text": "Victim hides behavior to avoid shame-based punishment",
        "checked": false,
        "user_added": false,
        "description": "You lie to avoid the feeling of being small and judged.",
        "example": "You hide a parking ticket because you can't face his lecture on your incompetence."
      },
      {
        "ref": "O-SHA9",
        "text": "Shame is used instead of overt threats",
        "checked": false,
        "user_added": false,
        "description": "He doesn't need to hit you; he just needs to look at you like you are disgusting.",
        "example": "He sneers at you when you cry, making you feel pathetic for having emotions."
      },
      {
        "ref": "O-SHA10",
        "text": "Victim's self-worth becomes tied to the abuser",
        "checked": false,
        "user_added": false,
        "description": "You see yourself only through his eyes.",
        "example": "If he thinks you are stupid, you believe you are stupid."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-SHB1",
        "text": "She apologizes automatically for everything, even harmless things.",
        "checked": false,
        "user_added": false,
        "description": "Sorry has become your shield; you use it to deflect potential anger.",
        "example": "You bump into a table and say 'sorry' to him."
      },
      {
        "ref": "V-SHB2",
        "text": "She feels unworthy, inadequate, or like a burden.",
        "checked": false,
        "user_added": false,
        "description": "You carry a heavy backpack of shame that he put there.",
        "example": "You feel like you are taking up too much space just by existing."
      },
      {
        "ref": "V-SHB3",
        "text": "She blames herself for the abuser's behavior.",
        "checked": false,
        "user_added": false,
        "description": "You internalize his lack of control as your failure to manage him.",
        "example": "You think, 'He wouldn't have cheated if I was prettier.'"
      },
      {
        "ref": "V-SHB4",
        "text": "She feels shame when she thinks for herself or disagrees.",
        "checked": false,
        "user_added": false,
        "description": "Autonomy feels like a sin.",
        "example": "You feel a flash of guilt when you order a different meal than what he suggested."
      },
      {
        "ref": "V-SHB5",
        "text": "She hides her feelings or actions because she fears judgment.",
        "checked": false,
        "user_added": false,
        "description": "You live in the shadows to avoid his spotlight of criticism.",
        "example": "You don't tell him about your promotion because you fear he will make you feel small about it."
      },
      {
        "ref": "V-SHB6",
        "text": "She believes she deserves his coldness or anger.",
        "checked": false,
        "user_added": false,
        "description": "You have accepted his verdict that you are guilty.",
        "example": "You cry alone in the bedroom, thinking, 'I brought this on myself.'"
      },
      {
        "ref": "V-SHB7",
        "text": "She avoids conflict because shame feels unbearable.",
        "checked": false,
        "user_added": false,
        "description": "Being told you are wrong feels like a death sentence to your ego.",
        "example": "You let him win every argument just to stop the feeling of being torn apart."
      },
      {
        "ref": "V-SHB8",
        "text": "She becomes emotionally dependent on his approval.",
        "checked": false,
        "user_added": false,
        "description": "His praise is the only water in your desert.",
        "example": "You wait all day for him to say 'good job' on dinner, and are crushed if he says nothing."
      },
      {
        "ref": "V-SHB9",
        "text": "She experiences shame when others question his influence.",
        "checked": false,
        "user_added": false,
        "description": "You feel embarrassed that others can see the strings on the puppet.",
        "example": "You get defensive when a friend asks why he calls so much, feeling ashamed of your submission."
      },
      {
        "ref": "V-SHB10",
        "text": "She internalizes guilt until it becomes her default emotional state.",
        "checked": false,
        "user_added": false,
        "description": "Guilt is the background noise of your life.",
        "example": "You wake up feeling like you've done something wrong before the day has even started."
      }
    ]
  },
  "GaslightingMarkers": {
    "title": "Gaslighting and Reality Manipulation Markers",
    "intro": "This section describes signs that someone’s perception of reality may have been distorted over time.",
    "description": "Gaslighting involves being told events didn’t happen, emotions are invalid, or memories are wrong. This gradually creates doubt and confusion. This section outlines markers that indicate someone’s understanding of reality may have been influenced or shifted by repeated contradiction or rewriting.",
    "offender_behavior": [
      {
        "ref": "O-GAA1",
        "text": "Victim doubts her memory frequently",
        "checked": false,
        "user_added": false,
        "description": "He persistently challenges your recall until you stop trusting your own mind.",
        "example": "He insists you never told him about the dinner plans, making you wonder if you imagined the conversation."
      },
      {
        "ref": "O-GAA2",
        "text": "Abuser denies events that clearly happened",
        "checked": false,
        "user_added": false,
        "description": "He blatantly lies about reality to destabilize your footing.",
        "example": "He says 'I never said that' about a comment he made five minutes ago."
      },
      {
        "ref": "O-GAA3",
        "text": "Abuser reframes intentions to make himself appear harmless",
        "checked": false,
        "user_added": false,
        "description": "He twists his cruelty into kindness to confuse you.",
        "example": "He says his controlling behavior is just because he 'cares so much' about your safety."
      },
      {
        "ref": "O-GAA4",
        "text": "Victim believes she is overreacting or imagining things",
        "checked": false,
        "user_added": false,
        "description": "He labels your valid emotions as 'hysteria' or 'craziness'.",
        "example": "He tells you to 'stop making a scene' when you quietly cry after he insults you."
      },
      {
        "ref": "O-GAA5",
        "text": "Abuser uses contradictions to create confusion",
        "checked": false,
        "user_added": false,
        "description": "He says one thing and does another, keeping you in a state of cognitive dissonance.",
        "example": "He says he supports your career but then complains whenever you go to work."
      },
      {
        "ref": "O-GAA6",
        "text": "He minimizes events that were harmful or abusive",
        "checked": false,
        "user_added": false,
        "description": "He shrinks his violence to make it seem acceptable.",
        "example": "He calls pushing you 'a little nudge'."
      },
      {
        "ref": "O-GAA7",
        "text": "Victim questions her own sanity or judgment",
        "checked": false,
        "user_added": false,
        "description": "He drives you to the brink of believing you are mentally ill.",
        "example": "He asks, 'Are you off your meds?' whenever you disagree with him."
      },
      {
        "ref": "O-GAA8",
        "text": "Abuser controls the narrative of past events",
        "checked": false,
        "user_added": false,
        "description": "He acts as the historian of the relationship, editing out his abuse.",
        "example": "He retells stories of fights where he was calm and you were the aggressor, even though it was the opposite."
      },
      {
        "ref": "O-GAA9",
        "text": "Victim feels unstable around the truth",
        "checked": false,
        "user_added": false,
        "description": "He has made truth slippery; you never know where you stand.",
        "example": "You record conversations just to prove to yourself what was said."
      },
      {
        "ref": "O-GAA10",
        "text": "Abuser manipulates emotional context to rewrite reality",
        "checked": false,
        "user_added": false,
        "description": "He changes the 'why' behind actions to suit his needs.",
        "example": "He claims he flirted with the waitress just to 'make you jealous because you've been distant,' blaming you for his action."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-GAB1",
        "text": "She begins doubting her own perception of events.",
        "checked": false,
        "user_added": false,
        "description": "You feel like the ground is always moving under your feet.",
        "example": "You check the calendar three times because you don't trust yourself to know the date."
      },
      {
        "ref": "V-GAB2",
        "text": "She repeats his version of events even when it contradicts clear facts.",
        "checked": false,
        "user_added": false,
        "description": "Surrendering to his reality is less painful than fighting for yours.",
        "example": "You tell friends, 'He didn't hit me, he just held me too tight,' echoing his words."
      },
      {
        "ref": "V-GAB3",
        "text": "She becomes confused when recalling details she once knew clearly.",
        "checked": false,
        "user_added": false,
        "description": "The mental fog of abuse makes memories hazy.",
        "example": "You can't remember how the argument started, only that it ended with you apologizing."
      },
      {
        "ref": "V-GAB4",
        "text": "She hesitates before expressing her memory of something.",
        "checked": false,
        "user_added": false,
        "description": "You pause to check if your memory matches his 'approved' version.",
        "example": "You look at him for confirmation before telling a story about your weekend."
      },
      {
        "ref": "V-GAB5",
        "text": "She corrects herself based on what he said, rather than what she experienced.",
        "checked": false,
        "user_added": false,
        "description": "You edit your life in real-time to avoid conflict.",
        "example": "You say, 'We left at 8,' then quickly correct to 'No, 8:30,' because he glared at you."
      },
      {
        "ref": "V-GAB6",
        "text": "She minimizes harmful events because he reframed them to sound harmless.",
        "checked": false,
        "user_added": false,
        "description": "You adopt his soft language to hide the hard truth.",
        "example": "You call his verbal abuse 'venting stress'."
      },
      {
        "ref": "V-GAB7",
        "text": "She feels unsure of her own judgment in everyday situations.",
        "checked": false,
        "user_added": false,
        "description": "If you can't trust yourself about abuse, you feel you can't trust yourself about anything.",
        "example": "You ask for a second opinion on everything, from what to wear to what to eat."
      },
      {
        "ref": "V-GAB8",
        "text": "She becomes distressed when her memory doesn't match his story.",
        "checked": false,
        "user_added": false,
        "description": "Cognitive dissonance creates physical anxiety.",
        "example": "You feel a wave of nausea when he casually lies about where he was last night."
      },
      {
        "ref": "V-GAB9",
        "text": "She defends the abuser's version of events to avoid emotional instability.",
        "checked": false,
        "user_added": false,
        "description": "You protect his lie to protect your peace.",
        "example": "You argue with your mom that he was 'just joking,' even though you know he wasn't."
      },
      {
        "ref": "V-GAB10",
        "text": "She feels like she is ‘losing herself' because her perception no longer feels reliable.",
        "checked": false,
        "user_added": false,
        "description": "The core of your identity—your mind—feels compromised.",
        "example": "You write in a journal, 'I don't know what is real anymore.'"
      }
    ]
  },
  "EmotionalCollapse": {
    "title": "Emotional Collapse and Instability",
    "intro": "This section focuses on moments where your emotions became overwhelming or shut down completely.",
    "description": "Emotional collapse happens when the pressure, confusion, and instability become too much. It can show up as sudden crying, numbness, freezing, shutting down, or feeling unable to function. These reactions are not weakness—they are signs your nervous system was pushed beyond what it could handle. This section helps you recognise how emotional overload was created and reinforced.",
    "offender_behavior": [
      {
        "ref": "O-EC1",
        "text": "Sudden loss of emotional stability",
        "checked": false,
        "user_added": false,
        "description": "He pushes you until you break, using your breakdown as proof of your 'instability'.",
        "example": "He argues with you for hours until you are hysterical, then calmly asks why you are so emotional."
      },
      {
        "ref": "O-EC2",
        "text": "Extreme emotional responses to small triggers",
        "checked": false,
        "user_added": false,
        "description": "He has sensitized you so that even a small poke feels like a stab wound.",
        "example": "He sighs loudly, and you burst into tears because that sigh usually precedes a scream."
      },
      {
        "ref": "O-EC3",
        "text": "Periods of numbness followed by overwhelm",
        "checked": false,
        "user_added": false,
        "description": "He keeps you on an emotional roller coaster that exhausts your system.",
        "example": "You feel nothing for days, then suddenly cry for three hours straight."
      },
      {
        "ref": "O-EC4",
        "text": "Crying episodes without clear reasons",
        "checked": false,
        "user_added": false,
        "description": "He has filled your cup of stress until it overflows at random times.",
        "example": "You start weeping while doing the dishes, overwhelmed by the unspoken tension."
      },
      {
        "ref": "O-EC5",
        "text": "Inability to articulate what she feels",
        "checked": false,
        "user_added": false,
        "description": "He has tangled your thoughts so much that you can't find the words.",
        "example": "You open your mouth to explain why you're sad, but no sound comes out."
      },
      {
        "ref": "O-EC6",
        "text": "Emotional shutdown when facing truth",
        "checked": false,
        "user_added": false,
        "description": "He has made the truth so terrifying that your brain refuses to look at it.",
        "example": "You go blank and stare at the floor when someone asks if he hits you."
      },
      {
        "ref": "O-EC7",
        "text": "Stress responses when asked direct questions",
        "checked": false,
        "user_added": false,
        "description": "He has conditioned you to view questions as interrogations.",
        "example": "You start sweating and shaking when a friend simply asks, 'What did you do today?'"
      },
      {
        "ref": "O-EC8",
        "text": "Being overwhelmed by choices",
        "checked": false,
        "user_added": false,
        "description": "He has eroded your agency, making decision-making feel heavy and dangerous.",
        "example": "You have a meltdown in the cereal aisle because you can't choose a brand."
      },
      {
        "ref": "O-EC9",
        "text": "Loss of ability to regulate emotions",
        "checked": false,
        "user_added": false,
        "description": "He has broken your internal thermostat; you are either freezing or boiling.",
        "example": "You rage at a minor inconvenience because you have no patience left."
      },
      {
        "ref": "O-EC10",
        "text": "Exhaustion from internal conflict",
        "checked": false,
        "user_added": false,
        "description": "He has pitted your heart against your brain, creating a war inside you.",
        "example": "You are physically tired all the time because fighting the cognitive dissonance burns so much energy."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-EC1",
        "text": "She breaks down emotionally when confronted with contradictions between her actions and his influence.",
        "checked": false,
        "user_added": false,
        "description": "The gap between who you were and who you are now is painful to see.",
        "example": "You sob when you realize you defended the man who hurt you."
      },
      {
        "ref": "V-EC2",
        "text": "She switches rapidly between anger, sadness, confusion, and numbness.",
        "checked": false,
        "user_added": false,
        "description": "Your nervous system is misfiring as it tries to process the trauma.",
        "example": "You yell at him, then immediately apologize and cry, then go silent."
      },
      {
        "ref": "V-EC3",
        "text": "She avoids talking about emotional conflict because it overwhelms her.",
        "checked": false,
        "user_added": false,
        "description": "You treat your emotions like a bomb that might go off if touched.",
        "example": "You say 'I'm fine' to shut down conversations that feel too heavy."
      },
      {
        "ref": "V-EC4",
        "text": "She experiences emotional shutdown when discussing him.",
        "checked": false,
        "user_added": false,
        "description": "Talking about him triggers a freeze response.",
        "example": "Your face goes slack and your voice monotone when recounting a fight."
      },
      {
        "ref": "V-EC5",
        "text": "She expresses hopelessness or says things like 'I don't know who I am anymore.'",
        "checked": false,
        "user_added": false,
        "description": "You are voicing the reality of identity erosion.",
        "example": "You look in the mirror and feel like a stranger is looking back."
      },
      {
        "ref": "V-EC6",
        "text": "Her emotions become unpredictable and disproportionate to the situation.",
        "checked": false,
        "user_added": false,
        "description": "Trauma leaks out sideways.",
        "example": "You have a panic attack because you dropped a spoon."
      },
      {
        "ref": "V-EC7",
        "text": "She becomes emotionally frozen when asked about her choices.",
        "checked": false,
        "user_added": false,
        "description": "You are paralyzed by the fear of making the wrong move.",
        "example": "You sit in silence for minutes when asked what you want for dinner."
      },
      {
        "ref": "V-EC8",
        "text": "She expresses severe guilt or shame for wanting something other than what he wants.",
        "checked": false,
        "user_added": false,
        "description": "You have internalized his needs as your command.",
        "example": "You feel selfish for wanting to visit your sick mother instead of staying with him."
      },
      {
        "ref": "V-EC9",
        "text": "She shows visible distress when confronted with truth that conflicts with his narrative.",
        "checked": false,
        "user_added": false,
        "description": "The truth hurts because it shatters the illusion keeping you safe.",
        "example": "You cover your ears or shake your head when someone tells you he is lying."
      },
      {
        "ref": "V-EC10",
        "text": "She becomes highly reactive to emotional pressure and withdraws quickly.",
        "checked": false,
        "user_added": false,
        "description": "You are like a wounded animal, snapping or hiding when approached.",
        "example": "You hang up the phone immediately if the conversation gets tense."
      }
    ]
  },
  "TraumaIndicators": {
    "title": "Trauma and Nervous System Responses",
    "intro": "This section shows physical and emotional reactions that come from feeling unsafe or overwhelmed.",
    "description": "Trauma lives in the body. You might freeze during conflict, feel guilty for no reason, avoid certain topics, overthink everything, or become hyper-alert to tone and behaviour. These are automatic survival responses—your body protecting you. This section highlights patterns that show the emotional environment you were in was triggering real trauma responses.",
    "offender_behavior": [
      {
        "ref": "O-TR1",
        "text": "Fight, flight, freeze, or fawn responses during conflict",
        "checked": false,
        "user_added": false,
        "description": "He triggers your primal survival instincts.",
        "example": "He yells, and you either scream back (fight), run away (flight), go silent (freeze), or apologize profusely (fawn)."
      },
      {
        "ref": "O-TR2",
        "text": "Hypervigilance",
        "checked": false,
        "user_added": false,
        "description": "He keeps you on edge so you are always watching for threats.",
        "example": "You jump at the sound of a door closing."
      },
      {
        "ref": "O-TR3",
        "text": "Fear of disappointing the abuser",
        "checked": false,
        "user_added": false,
        "description": "He has made his disappointment feel like a life-threatening event.",
        "example": "You panic because you forgot to buy his favorite snack."
      },
      {
        "ref": "O-TR4",
        "text": "Startle responses when discussing difficult topics",
        "checked": false,
        "user_added": false,
        "description": "He has associated certain words with pain.",
        "example": "You flinch when someone says the word 'money' because he controls the finances."
      },
      {
        "ref": "O-TR5",
        "text": "Dissociation or spacing out",
        "checked": false,
        "user_added": false,
        "description": "He overwhelms you until your mind leaves your body.",
        "example": "He is talking to you, but you are staring at the wall, hearing nothing."
      },
      {
        "ref": "O-TR6",
        "text": "Flash emotional withdrawal",
        "checked": false,
        "user_added": false,
        "description": "He forces you to shut down instantly to avoid escalation.",
        "example": "You go from laughing to stone-cold silent the moment he walks in."
      },
      {
        "ref": "O-TR7",
        "text": "Flattened affect or emotional numbness",
        "checked": false,
        "user_added": false,
        "description": "He has burned out your emotional receptors.",
        "example": "You recount a traumatic event with no emotion on your face."
      },
      {
        "ref": "O-TR8",
        "text": "Tension in voice or body when mentioning him",
        "checked": false,
        "user_added": false,
        "description": "Your body reacts to him as a threat.",
        "example": "Your shoulders hunch up and your voice gets tight when you say his name."
      },
      {
        "ref": "O-TR9",
        "text": "Self-blame tendencies",
        "checked": false,
        "user_added": false,
        "description": "He has trained you to turn your anger inward.",
        "example": "You hit yourself or call yourself stupid when you make a mistake."
      },
      {
        "ref": "O-TR10",
        "text": "Shame attached to normal emotional needs",
        "checked": false,
        "user_added": false,
        "description": "He makes you feel 'needy' for having basic human requirements.",
        "example": "You feel ashamed for wanting a hug."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-TR1",
        "text": "She freezes or becomes silent during discussions she perceives as dangerous.",
        "checked": false,
        "user_added": false,
        "description": "Your body is playing dead to survive the predator.",
        "example": "You go mute when he asks you a question in an angry tone."
      },
      {
        "ref": "V-TR2",
        "text": "She becomes hyper-alert to emotional cues and overanalyzes interactions.",
        "checked": false,
        "user_added": false,
        "description": "You are reading the room to predict the weather.",
        "example": "You analyze the punctuation in his text message to guess if he is mad."
      },
      {
        "ref": "V-TR3",
        "text": "She avoids topics that trigger trauma-based reactions.",
        "checked": false,
        "user_added": false,
        "description": "You walk around the landmines.",
        "example": "You never talk about your past because he uses it against you."
      },
      {
        "ref": "V-TR4",
        "text": "She experiences sudden emotional shutdown when overwhelmed.",
        "checked": false,
        "user_added": false,
        "description": "Your fuses blow to prevent a system meltdown.",
        "example": "You suddenly feel incredibly sleepy in the middle of an argument."
      },
      {
        "ref": "V-TR5",
        "text": "She displays fawn responses—agreeing with everything to avoid conflict.",
        "checked": false,
        "user_added": false,
        "description": "You appease him to keep yourself safe.",
        "example": "You agree that you are stupid just to make him stop yelling."
      },
      {
        "ref": "V-TR6",
        "text": "She dissociates or 'checks out' mentally during stressful moments.",
        "checked": false,
        "user_added": false,
        "description": "Your mind goes to a safe place because your body cannot.",
        "example": "You feel like you are floating above your body while he screams."
      },
      {
        "ref": "V-TR7",
        "text": "She becomes physically tense or distressed when discussing him.",
        "checked": false,
        "user_added": false,
        "description": "The body keeps the score.",
        "example": "You get a headache or stomach ache whenever you think about going home."
      },
      {
        "ref": "V-TR8",
        "text": "She expresses fear of being alone or unsupported.",
        "checked": false,
        "user_added": false,
        "description": "He has eroded your self-reliance.",
        "example": "You panic at the thought of living alone."
      },
      {
        "ref": "V-TR9",
        "text": "She questions her sanity, memory, or perception.",
        "checked": false,
        "user_added": false,
        "description": "Gaslighting has worked; you don't trust your own hardware.",
        "example": "You ask, 'Am I crazy?' repeatedly."
      },
      {
        "ref": "V-TR10",
        "text": "Her nervous system reacts as if she is in danger even in safe conversations.",
        "checked": false,
        "user_added": false,
        "description": "You are stuck in 'threat' mode.",
        "example": "You startle and defend yourself when a friend gently asks for a favor."
      }
    ]
  },
  "LongTermImpact": {
    "title": "Long-Term Emotional and Psychological Impact",
    "intro": "This section looks at how the experience affected you over time, even after the situation changed.",
    "description": "Long-term impact shows up in identity changes, difficulty trusting, chronic self-doubt, emotional instability, avoidance of relationships, and internalized shame. These are not personality traits—they are adaptations to survive prolonged emotional harm. This section helps you understand how deep the influence went and how it shaped long-term emotional patterns.",
    "offender_behavior": [
      {
        "ref": "O-LT1",
        "text": "Identity loss",
        "checked": false,
        "user_added": false,
        "description": "He erased who you were to make room for who he wanted.",
        "example": "You no longer know what your favorite color is because he always picked for you."
      },
      {
        "ref": "O-LT2",
        "text": "Chronic emotional dependency",
        "checked": false,
        "user_added": false,
        "description": "He disabled your independence engine.",
        "example": "You feel incapable of managing your life without a partner."
      },
      {
        "ref": "O-LT3",
        "text": "Difficulty forming new attachments",
        "checked": false,
        "user_added": false,
        "description": "He taught you that closeness equals pain.",
        "example": "You push away nice people because their kindness feels suspicious."
      },
      {
        "ref": "O-LT4",
        "text": "Self-doubt embedded into personality",
        "checked": false,
        "user_added": false,
        "description": "His voice has become your inner critic.",
        "example": "You constantly second-guess your work, hearing his insults in your head."
      },
      {
        "ref": "O-LT5",
        "text": "Long-term confusion about past events",
        "checked": false,
        "user_added": false,
        "description": "He scrambled your history so you can't find your footing.",
        "example": "Years later, you still aren't sure if he cheated or if you were 'crazy'."
      },
      {
        "ref": "O-LT6",
        "text": "Inability to trust intuition",
        "checked": false,
        "user_added": false,
        "description": "He trained you to ignore your gut.",
        "example": "You stay in bad situations because you don't trust your warning bells."
      },
      {
        "ref": "O-LT7",
        "text": "Fear of relationships",
        "checked": false,
        "user_added": false,
        "description": "He poisoned the well of intimacy.",
        "example": "You decide to stay single forever to avoid being controlled again."
      },
      {
        "ref": "O-LT8",
        "text": "Emotional instability as a baseline",
        "checked": false,
        "user_added": false,
        "description": "He kept you in chaos for so long that peace feels boring or wrong.",
        "example": "You pick fights in healthy relationships just to feel something familiar."
      },
      {
        "ref": "O-LT9",
        "text": "Chronic guilt or shame",
        "checked": false,
        "user_added": false,
        "description": "He stained your self-image.",
        "example": "You feel guilty whenever you take time for yourself, even years later."
      },
      {
        "ref": "O-LT10",
        "text": "Avoidance of honesty due to fear of consequences",
        "checked": false,
        "user_added": false,
        "description": "He taught you that the truth is dangerous.",
        "example": "You lie about small things to your friends just to be safe."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-LT1",
        "text": "She struggles to trust people who genuinely care about her.",
        "checked": false,
        "user_added": false,
        "description": "Trust was a trap in the past, so you avoid it now.",
        "example": "You wonder what your new partner 'really wants' when they bring you flowers."
      },
      {
        "ref": "V-LT2",
        "text": "She carries guilt long after events have passed.",
        "checked": false,
        "user_added": false,
        "description": "You are still holding the bag for his sins.",
        "example": "You feel guilty for 'failing' the relationship, even though he destroyed it."
      },
      {
        "ref": "V-LT3",
        "text": "She becomes avoidant of deep relationships due to fear of manipulation.",
        "checked": false,
        "user_added": false,
        "description": "You keep people at arm's length to protect your heart.",
        "example": "You break up with people as soon as they get too close."
      },
      {
        "ref": "V-LT4",
        "text": "She experiences long-term emotional exhaustion.",
        "checked": false,
        "user_added": false,
        "description": "Recovery takes energy you don't have yet.",
        "example": "You feel tired deep in your bones, even after sleeping."
      },
      {
        "ref": "V-LT5",
        "text": "She forms repeating patterns of bonding with unsafe people.",
        "checked": false,
        "user_added": false,
        "description": "You gravitate towards the familiar, even if the familiar is toxic.",
        "example": "You find yourself dating another controlling person because it feels 'normal'."
      },
      {
        "ref": "V-LT6",
        "text": "She minimizes her own needs long-term because of conditioning.",
        "checked": false,
        "user_added": false,
        "description": "You have learned to exist without taking up space.",
        "example": "You never ask for what you want in bed or at dinner."
      },
      {
        "ref": "V-LT7",
        "text": "She avoids thinking about the past because it triggers destabilizing emotions.",
        "checked": false,
        "user_added": false,
        "description": "The past is a haunted house you refuse to enter.",
        "example": "You change the channel if a movie reminds you of him."
      },
      {
        "ref": "V-LT8",
        "text": "She feels disconnected from who she used to be.",
        "checked": false,
        "user_added": false,
        "description": "The bridge to your old self has been burned.",
        "example": "You mourn the girl you were before him as if she died."
      },
      {
        "ref": "V-LT9",
        "text": "She becomes highly emotional in situations where she used to be stable.",
        "checked": false,
        "user_added": false,
        "description": "Your resilience has been worn thin.",
        "example": "You cry when you lose your keys, feeling totally overwhelmed."
      },
      {
        "ref": "V-LT10",
        "text": "She struggles to rebuild identity or stability after leaving the abuser's influence.",
        "checked": false,
        "user_added": false,
        "description": "You are learning to walk again after being carried in a cage.",
        "example": "You sit in your new apartment and don't know what to do with your freedom."
      }
    ]
  },
  "DissociationPatterns": {
    "title": "Dissociation and Emotional Detachment",
    "intro": "This section focuses on moments where your mind disconnected to protect you from emotional overload.",
    "description": "Dissociation can feel like going numb, zoning out, losing time, not remembering details, or emotionally disconnecting from yourself or others. It happens when the emotional environment becomes too overwhelming for your nervous system. This section helps you recognise the protective role dissociation played during stressful or confusing moments.",
    "offender_behavior": [
      {
        "ref": "O-DS1",
        "text": "Spacing out or disconnecting during emotional stress",
        "checked": false,
        "user_added": false,
        "description": "He overwhelms you, so your brain pulls the plug.",
        "example": "He is yelling, and you find yourself staring at a pattern in the rug, not hearing words."
      },
      {
        "ref": "O-DS2",
        "text": "Difficulty remembering events clearly",
        "checked": false,
        "user_added": false,
        "description": "He creates trauma, and your brain blocks it out to protect you.",
        "example": "You know you fought, but you can't recall what was said."
      },
      {
        "ref": "O-DS3",
        "text": "Emotional numbness",
        "checked": false,
        "user_added": false,
        "description": "He has exhausted your ability to feel.",
        "example": "He tells you he hates you, and you feel absolutely nothing."
      },
      {
        "ref": "O-DS4",
        "text": "Flat or blank responses",
        "checked": false,
        "user_added": false,
        "description": "He punishes emotion, so you stop showing it.",
        "example": "You speak in a monotone voice to give him nothing to attack."
      },
      {
        "ref": "O-DS5",
        "text": "Acting robotic or emotionless",
        "checked": false,
        "user_added": false,
        "description": "You go on autopilot to survive.",
        "example": "You cook, clean, and smile like a Stepford wife, with no one home inside."
      },
      {
        "ref": "O-DS6",
        "text": "Sudden detachment from previously meaningful things",
        "checked": false,
        "user_added": false,
        "description": "He has made joy dangerous or inaccessible.",
        "example": "You stop caring about your art because it feels too far away."
      },
      {
        "ref": "O-DS7",
        "text": "Saying things like 'I feel nothing' or 'I don't know what I feel'",
        "checked": false,
        "user_added": false,
        "description": "The connection between your mind and heart is severed.",
        "example": "You truly cannot identify if you are sad or angry; it's just blank."
      },
      {
        "ref": "O-DS8",
        "text": "Memory gaps around painful periods",
        "checked": false,
        "user_added": false,
        "description": "Your brain edited the movie to remove the horror scenes.",
        "example": "You can't remember the month of December."
      },
      {
        "ref": "O-DS9",
        "text": "Avoiding emotional connection",
        "checked": false,
        "user_added": false,
        "description": "Connection hurts, so you stay disconnected.",
        "example": "You don't let anyone hug you because it feels unsafe."
      },
      {
        "ref": "O-DS10",
        "text": "Detaching in arguments instead of responding",
        "checked": false,
        "user_added": false,
        "description": "You leave your body because it's not safe to be in it.",
        "example": "You sit limply while he rages, waiting for it to be over."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-DS1",
        "text": "She emotionally disconnects when overwhelmed or confronted.",
        "checked": false,
        "user_added": false,
        "description": "It's a safety switch; you power down to prevent a surge.",
        "example": "You go quiet and still when the yelling starts."
      },
      {
        "ref": "V-DS2",
        "text": "She cannot feel normal emotions in situations where she previously could.",
        "checked": false,
        "user_added": false,
        "description": "Your emotional spectrum has been narrowed to survival.",
        "example": "You don't feel excited about your birthday anymore."
      },
      {
        "ref": "V-DS3",
        "text": "She appears blank or distant when discussing the relationship or events.",
        "checked": false,
        "user_added": false,
        "description": "You are reciting facts, not reliving feelings.",
        "example": "You tell a horrific story of abuse with a casual, detached tone."
      },
      {
        "ref": "V-DS4",
        "text": "She experiences memory fog or gaps around stressful interactions.",
        "checked": false,
        "user_added": false,
        "description": "Stress hormones have blocked your memory formation.",
        "example": "You ask, 'Did we fight yesterday?' genuinely unsure."
      },
      {
        "ref": "V-DS5",
        "text": "She feels disconnected from her body or emotions during stress.",
        "checked": false,
        "user_added": false,
        "description": "Depersonalization makes you feel like an observer.",
        "example": "You feel like you are watching yourself in a movie."
      },
      {
        "ref": "V-DS6",
        "text": "She avoids emotionally charged topics by going numb.",
        "checked": false,
        "user_added": false,
        "description": "Numbness is your armor.",
        "example": "You change the subject to the weather when asked how you are."
      },
      {
        "ref": "V-DS7",
        "text": "She zones out, stares, or loses track of the conversation when overwhelmed.",
        "checked": false,
        "user_added": false,
        "description": "Your brain takes a holiday from the pain.",
        "example": "You realize you've been staring at the wall for 20 minutes."
      },
      {
        "ref": "V-DS8",
        "text": "She becomes unpredictable, switching between numb and reactive.",
        "checked": false,
        "user_added": false,
        "description": "You are oscillating between freezing and fighting.",
        "example": "You are stone cold one minute and screaming the next."
      },
      {
        "ref": "V-DS9",
        "text": "She disconnects from people she loves when she feels unsafe emotionally.",
        "checked": false,
        "user_added": false,
        "description": "You pull up the drawbridge to protect the castle.",
        "example": "You stop loving your dog because you fear he will hurt the dog to hurt you."
      },
      {
        "ref": "V-DS10",
        "text": "She acts like a spectator in her own life rather than a participant.",
        "checked": false,
        "user_added": false,
        "description": "You have lost your agency, so you just watch life happen.",
        "example": "You let him make all the choices while you just ride along."
      }
    ]
  },
  "RecoveryStateMarkers": {
    "title": "Signs of Emotional Recovery",
    "intro": "This section highlights small but important signs that you are returning to yourself.",
    "description": "Recovery shows up in moments of clarity, reconnecting with safe people, feeling emotions again, questioning old patterns, remembering events more clearly, or feeling anger instead of guilt. These shifts mean your mind and nervous system are waking up from the fog. This section helps you see the progress you're making—even if it feels slow or subtle.",
    "offender_behavior": [
      {
        "ref": "O-RC1",
        "text": "She begins doubting the abuser's narrative",
        "checked": false,
        "user_added": false,
        "description": "The fog is lifting; she sees the cracks in his story.",
        "example": "She thinks, 'That doesn't make sense,' when he blames her."
      },
      {
        "ref": "O-RC2",
        "text": "She asks questions instead of accepting his version",
        "checked": false,
        "user_added": false,
        "description": "Curiosity is returning, replacing blind submission.",
        "example": "She asks, 'Why do you get to decide that?'"
      },
      {
        "ref": "O-RC3",
        "text": "She reconnects emotionally with safe people",
        "checked": false,
        "user_added": false,
        "description": "The isolation is breaking; she is reaching out.",
        "example": "She calls her sister just to say hi."
      },
      {
        "ref": "O-RC4",
        "text": "She regains moments of her old personality",
        "checked": false,
        "user_added": false,
        "description": "Her true self is peeking through the trauma.",
        "example": "She laughs a real, belly laugh for the first time in months."
      },
      {
        "ref": "O-RC5",
        "text": "She expresses anger or boundaries",
        "checked": false,
        "user_added": false,
        "description": "Anger is a sign of self-respect returning.",
        "example": "She says, 'Don't talk to me like that,' instead of looking down."
      },
      {
        "ref": "O-RC6",
        "text": "She reconnects with memories she suppressed",
        "checked": false,
        "user_added": false,
        "description": "Her brain feels safe enough to unlock the files.",
        "example": "She remembers a time he was cruel and validates her own pain."
      },
      {
        "ref": "O-RC7",
        "text": "She regains clarity in decisions",
        "checked": false,
        "user_added": false,
        "description": "The paralysis is fading; she knows what she wants.",
        "example": "She chooses a restaurant without asking for permission."
      },
      {
        "ref": "O-RC8",
        "text": "She feels confused about why she defended him",
        "checked": false,
        "user_added": false,
        "description": "Hindsight is bringing perspective.",
        "example": "She wonders, 'Why did I think that was love?'"
      },
      {
        "ref": "O-RC9",
        "text": "She revisits past events with new understanding",
        "checked": false,
        "user_added": false,
        "description": "She is re-processing the trauma with open eyes.",
        "example": "She realizes that what she thought was 'protectiveness' was actually control."
      },
      {
        "ref": "O-RC10",
        "text": "She begins to feel her emotions again",
        "checked": false,
        "user_added": false,
        "description": "The numbness is thawing.",
        "example": "She cries happy tears at a movie, feeling the full range of human emotion."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-RC1",
        "text": "She starts questioning the things he told her as truth.",
        "checked": false,
        "user_added": false,
        "description": "You are waking up and realizing the world isn't what he said it was.",
        "example": "You check your bank account and realize you aren't 'bad with money' like he said."
      },
      {
        "ref": "V-RC2",
        "text": "She experiences flashes of clarity where everything makes sense for a moment.",
        "checked": false,
        "user_added": false,
        "description": "The puzzle pieces are snapping together.",
        "example": "You suddenly see the cycle of abuse clearly while driving to work."
      },
      {
        "ref": "V-RC3",
        "text": "She reaches out to someone she trusts after being isolated.",
        "checked": false,
        "user_added": false,
        "description": "You are building a bridge back to the living.",
        "example": "You send a text to a friend you haven't seen in a year."
      },
      {
        "ref": "V-RC4",
        "text": "She shows small signs of anger toward him instead of fear.",
        "checked": false,
        "user_added": false,
        "description": "Anger is the bodyguard of your soul; it means you know you deserve better.",
        "example": "You feel a spark of rage when he insults you, instead of shame."
      },
      {
        "ref": "V-RC5",
        "text": "She experiences emotional pain when truth returns, showing her numbness is lifting.",
        "checked": false,
        "user_added": false,
        "description": "Pain is a sign that the anesthesia is wearing off.",
        "example": "You cry about the lost years, which hurts, but feels real."
      },
      {
        "ref": "V-RC6",
        "text": "She expresses confusion about why she ever defended him.",
        "checked": false,
        "user_added": false,
        "description": "You are stepping out of the trance.",
        "example": "You look at texts where you apologized and think, 'Why did I do that?'"
      },
      {
        "ref": "V-RC7",
        "text": "She remembers events more clearly after time away from him.",
        "checked": false,
        "user_added": false,
        "description": "Distance gives you perspective.",
        "example": "You recall exactly what he said that night, without his voice distorting it."
      },
      {
        "ref": "V-RC8",
        "text": "She rediscovers pieces of her old personality.",
        "checked": false,
        "user_added": false,
        "description": "You are excavating yourself from the rubble.",
        "example": "You start singing in the shower again."
      },
      {
        "ref": "V-RC9",
        "text": "She begins expressing her own opinions again.",
        "checked": false,
        "user_added": false,
        "description": "Your voice is coming back.",
        "example": "You say 'I disagree' and hold your ground."
      },
      {
        "ref": "V-RC10",
        "text": "She slowly gains emotional independence and the ability to think clearly.",
        "checked": false,
        "user_added": false,
        "description": "You are becoming the captain of your own ship again.",
        "example": "You make a plan for the weekend without wondering what he would think."
      }
    ]
  },
  "StockholmBondingPatterns": {
    "title": "Stockholm-Style Traumatic Bonding",
    "intro": "This section explores how strong emotional ties can form in confusing or stressful situations.",
    "description": "When a person experiences stress alongside moments of care or support, the nervous system can link the other person to safety. This creates loyalty or protectiveness even when the environment is unstable. This section describes how these bonds form and why they can feel so powerful.",
    "offender_behavior": [
      {
        "ref": "O-SB1",
        "text": "Victim defends the abuser to avoid emotional danger",
        "checked": false,
        "user_added": false,
        "description": "He has made himself the danger, so she aligns with him to survive him.",
        "example": "She tells the police 'it was a misunderstanding' while he glares at her."
      },
      {
        "ref": "O-SB2",
        "text": "Positive feelings emerge toward the abuser during stress",
        "checked": false,
        "user_added": false,
        "description": "He terrifies her, then comforts her, hijacking her attachment system.",
        "example": "She clings to him during a storm, forgetting he is the one who locked her out in the rain."
      },
      {
        "ref": "O-SB3",
        "text": "Abuser positioned as protector against situations he caused",
        "checked": false,
        "user_added": false,
        "description": "He creates the fire and then plays the fireman.",
        "example": "He gets her fired, then comforts her about being unemployed."
      },
      {
        "ref": "O-SB4",
        "text": "Victim rewrites memories to make abuser seem benevolent",
        "checked": false,
        "user_added": false,
        "description": "She edits the past to make the present bearable.",
        "example": "She remembers him 'helping her improve' instead of criticizing her constantly."
      },
      {
        "ref": "O-SB5",
        "text": "Victim minimises abuse to preserve attachment",
        "checked": false,
        "user_added": false,
        "description": "She needs the bond to survive, so she denies the things that threaten it.",
        "example": "She says 'all couples fight' to normalize his violence."
      },
      {
        "ref": "O-SB6",
        "text": "Moments of kindness overshadow prolonged harm",
        "checked": false,
        "user_added": false,
        "description": "He buys her loyalty with cheap intermittent rewards.",
        "example": "She focuses on the one birthday card he wrote, ignoring 364 days of insults."
      },
      {
        "ref": "O-SB7",
        "text": "Victim becomes loyal due to fear of losing connection",
        "checked": false,
        "user_added": false,
        "description": "He has made himself her whole world; losing him feels like the end of the world.",
        "example": "She cuts off her family to prove her loyalty to him."
      },
      {
        "ref": "O-SB8",
        "text": "Victim feels gratitude for basic decency",
        "checked": false,
        "user_added": false,
        "description": "He lowered the bar so much that not being hit feels like a gift.",
        "example": "She thanks him profusely for letting her sleep in."
      },
      {
        "ref": "O-SB9",
        "text": "Victim sees abuser as someone who 'understands' them best",
        "checked": false,
        "user_added": false,
        "description": "He isolates her until they have a shared, warped reality.",
        "example": "She thinks only he knows the 'real' her, which is the broken version he created."
      },
      {
        "ref": "O-SB10",
        "text": "Victim interprets abusive control as care",
        "checked": false,
        "user_added": false,
        "description": "He rebrands obsession as love.",
        "example": "She believes his stalking checks are just him 'being protective'."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-SB1",
        "text": "She feels gratitude toward him for minimal acts of decency he uses to reinforce the bond.",
        "checked": false,
        "user_added": false,
        "description": "You are starved for affection, so a crumb looks like a meal.",
        "example": "You feel overwhelmingly thankful that he did the dishes once."
      },
      {
        "ref": "V-SB2",
        "text": "She defends him instinctively even when logic shows he harmed her.",
        "checked": false,
        "user_added": false,
        "description": "You are protecting the mechanism that keeps you safe.",
        "example": "You argue with a friend who calls him abusive, feeling a need to protect his image."
      },
      {
        "ref": "V-SB3",
        "text": "She believes only he understands her, despite evidence he destabilized her.",
        "checked": false,
        "user_added": false,
        "description": "The trauma bond feels deeper than normal relationships.",
        "example": "You feel like no one else gets the 'intensity' of your connection."
      },
      {
        "ref": "V-SB4",
        "text": "She interprets emotional pressure as proof of how much he 'cares'.",
        "checked": false,
        "user_added": false,
        "description": "You confuse intensity with intimacy.",
        "example": "You think his jealousy is a sign of how much he loves you."
      },
      {
        "ref": "V-SB5",
        "text": "She rationalizes abusive behavior by saying he 'means well' or 'was trying to protect her'.",
        "checked": false,
        "user_added": false,
        "description": "You are projecting your own good intentions onto him.",
        "example": "You tell yourself he locked the door to keep you safe, not to trap you."
      },
      {
        "ref": "V-SB6",
        "text": "She becomes loyal because losing him feels more dangerous than staying.",
        "checked": false,
        "user_added": false,
        "description": "Fear of the unknown outweighs the pain of the known.",
        "example": "You defend him to others so they won't try to make you leave."
      },
      {
        "ref": "V-SB7",
        "text": "She reframes distressing memories to seem less harmful.",
        "checked": false,
        "user_added": false,
        "description": "You are mentally photoshopping the bruises out of the picture.",
        "example": "You remember the fight as 'passionate' rather than terrifying."
      },
      {
        "ref": "V-SB8",
        "text": "She experiences comfort being near him after conflict because relief feels like love.",
        "checked": false,
        "user_added": false,
        "description": "Your body relaxes when he stops yelling, and you mistake that relaxation for love.",
        "example": "You fall asleep in his arms immediately after a screaming match."
      },
      {
        "ref": "V-SB9",
        "text": "She reinterprets controlling actions as guidance or support.",
        "checked": false,
        "user_added": false,
        "description": "You view his commands as help because you feel helpless.",
        "example": "You appreciate him telling you what to wear because it saves you the anxiety of choosing."
      },
      {
        "ref": "V-SB10",
        "text": "She becomes protective of him against anyone who questions his behavior.",
        "checked": false,
        "user_added": false,
        "description": "You identify with the aggressor against the 'outside threat'.",
        "example": "You get angry at your mom for suggesting he isn't treating you right."
      }
    ]
  },
  "TriangulationPatterns": {
    "title": "Triangulation and Relationship Manipulation",
    "intro": "This section highlights situations where third parties are used to create tension or confusion.",
    "description": "Triangulation happens when someone brings another person into a conflict or relationship dynamic to create comparison, jealousy, loyalty shifts, or instability. This section outlines how triangulation affects trust, emotions, and decision-making.",
    "offender_behavior": [
      {
        "ref": "O-TG1",
        "text": "Abuser pits people against each other",
        "checked": false,
        "user_added": false,
        "description": "He creates artificial conflict so he can be the judge and jury.",
        "example": "He tells you your sister hates him, and tells your sister you hate her."
      },
      {
        "ref": "O-TG2",
        "text": "Creates jealousy or rivalry to gain control",
        "checked": false,
        "user_added": false,
        "description": "He makes you compete for his attention to lower your self-worth.",
        "example": "He constantly compares you to his ex-girlfriend, saying she was 'more fun'."
      },
      {
        "ref": "O-TG3",
        "text": "Tells each person different stories",
        "checked": false,
        "user_added": false,
        "description": "He manages information so that no two people have the same facts.",
        "example": "He tells you he's working late, but tells his friends he's with you, creating an alibi."
      },
      {
        "ref": "O-TG4",
        "text": "Uses conflict to isolate victim",
        "checked": false,
        "user_added": false,
        "description": "He ensures you are fighting with everyone else so you have only him.",
        "example": "He manufactures a feud between you and your best friend."
      },
      {
        "ref": "O-TG5",
        "text": "Positions himself as mediator or rescuer",
        "checked": false,
        "user_added": false,
        "description": "He causes the problem so he can solve it and look like a hero.",
        "example": "He 'defends' you from the rumors he started himself."
      },
      {
        "ref": "O-TG6",
        "text": "Drops information selectively to create chaos",
        "checked": false,
        "user_added": false,
        "description": "He uses secrets as grenades.",
        "example": "He 'accidentally' reveals a secret you told him to your mother to cause a fight."
      },
      {
        "ref": "O-TG7",
        "text": "Uses secrets to build loyalty",
        "checked": false,
        "user_added": false,
        "description": "He creates a 'us vs. them' dynamic by sharing fake secrets with you.",
        "example": "He tells you, 'Don't tell your family, but I'm the only one helping them with money.'"
      },
      {
        "ref": "O-TG8",
        "text": "Victim becomes confused about who is safe",
        "checked": false,
        "user_added": false,
        "description": "He blurs the lines so you don't know who to trust.",
        "example": "You stop trusting your friends because he claims they are flirting with him."
      },
      {
        "ref": "O-TG9",
        "text": "Abuser encourages victim to mistrust others",
        "checked": false,
        "user_added": false,
        "description": "He plants paranoia in your mind.",
        "example": "He says, 'They are only using you for your money,' about your friends."
      },
      {
        "ref": "O-TG10",
        "text": "Victim becomes dependent on the abuser's version of reality",
        "checked": false,
        "user_added": false,
        "description": "He becomes the filter through which you see the world.",
        "example": "You ask him what happened at the party because you don't trust your own eyes."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-TG1",
        "text": "She distrusts people who care about her because he reframed them as threats.",
        "checked": false,
        "user_added": false,
        "description": "You view your allies as enemies because he switched the labels.",
        "example": "You think your mom is 'controlling' because he told you she is trying to ruin your relationship."
      },
      {
        "ref": "V-TG2",
        "text": "She repeats stories or accusations he planted to create conflict.",
        "checked": false,
        "user_added": false,
        "description": "You are unknowingly acting as his mouthpiece.",
        "example": "You accuse your friend of being jealous, using his exact words."
      },
      {
        "ref": "V-TG3",
        "text": "She becomes confused about who hurt who because he altered the story.",
        "checked": false,
        "user_added": false,
        "description": "The narrative is so twisted you can't find the beginning.",
        "example": "You apologize to him for a fight he started with your brother."
      },
      {
        "ref": "V-TG4",
        "text": "She takes his side automatically during disagreements.",
        "checked": false,
        "user_added": false,
        "description": "Loyalty to him is your default setting.",
        "example": "You defend him when your friends say he was rude, even though you saw it too."
      },
      {
        "ref": "V-TG5",
        "text": "She avoids you because he positioned you as the cause of her stress.",
        "checked": false,
        "user_added": false,
        "description": "He has scapegoated your support system.",
        "example": "You stop seeing your sister because 'she always causes drama,' which is what he says."
      },
      {
        "ref": "V-TG6",
        "text": "She keeps secrets for him, believing it protects the bond.",
        "checked": false,
        "user_added": false,
        "description": "Secrecy is the glue of the trauma bond.",
        "example": "You don't tell anyone he lost his job, pretending everything is fine."
      },
      {
        "ref": "V-TG7",
        "text": "She sees him as the rescuer from situations he created.",
        "checked": false,
        "user_added": false,
        "description": "You are thanking the arsonist for putting out the fire.",
        "example": "You are grateful he drove you home after he got you too drunk to drive."
      },
      {
        "ref": "V-TG8",
        "text": "She becomes emotionally conflicted between loyalty to him and to herself.",
        "checked": false,
        "user_added": false,
        "description": "You are being torn in half.",
        "example": "You feel guilty for loving your family when he hates them."
      },
      {
        "ref": "V-TG9",
        "text": "She unintentionally participates in the triangle dynamic he set up.",
        "checked": false,
        "user_added": false,
        "description": "You are a pawn in his game.",
        "example": "You try to make him jealous to get his attention, mimicking his behavior."
      },
      {
        "ref": "V-TG10",
        "text": "She uses phrases that indicate his influence: 'He was just trying to help,' etc.",
        "checked": false,
        "user_added": false,
        "description": "His justifications have become your explanations.",
        "example": "You excuse his prying questions as 'concern' because that's how he framed it."
      }
    ]
  },
  "SabotageBehaviors": {
    "title": "Sabotage Behaviors",
    "intro": "This section focuses on actions that disrupt a person’s progress, stability, or confidence.",
    "description": "Sabotage can be emotional, social, financial, or practical. It may include undermining confidence, interrupting goals, or creating obstacles. These behaviours often reduce independence without being obvious at first. This section explains how sabotage appears in relationships and how it influences daily functioning.",
    "offender_behavior": [
      {
        "ref": "O-SBH1",
        "text": "Abuser intentionally disrupts victim's relationships",
        "checked": false,
        "user_added": false,
        "description": "He throws wrenches into your social gears to stop them turning.",
        "example": "He starts an argument right before you leave for a friend's wedding."
      },
      {
        "ref": "O-SBH2",
        "text": "Withholds important information",
        "checked": false,
        "user_added": false,
        "description": "He keeps you in the dark to make you stumble.",
        "example": "He 'forgets' to tell you that your meeting was rescheduled."
      },
      {
        "ref": "O-SBH3",
        "text": "Interferes with victim's stability",
        "checked": false,
        "user_added": false,
        "description": "He knocks the legs out from under your chair.",
        "example": "He spends the rent money, causing a financial crisis."
      },
      {
        "ref": "O-SBH4",
        "text": "Creates crises to appear needed",
        "checked": false,
        "user_added": false,
        "description": "He manufactures emergencies where he is the only solution.",
        "example": "He disables your phone, then offers you his to use."
      },
      {
        "ref": "O-SBH5",
        "text": "Sabotages victim's goals or progress",
        "checked": false,
        "user_added": false,
        "description": "He clips your wings so you can't fly away.",
        "example": "He unplugs your alarm clock on the day of your big exam."
      },
      {
        "ref": "O-SBH6",
        "text": "Plants seeds of doubt about trusted people",
        "checked": false,
        "user_added": false,
        "description": "He poisons your water supply.",
        "example": "He wonders aloud if your best friend is hitting on him."
      },
      {
        "ref": "O-SBH7",
        "text": "Undermines self-esteem subtly",
        "checked": false,
        "user_added": false,
        "description": "He erodes your foundation so you collapse.",
        "example": "He asks, 'Are you really going to wear that?' with a sneer."
      },
      {
        "ref": "O-SBH8",
        "text": "Uses guilt to stop the victim from leaving",
        "checked": false,
        "user_added": false,
        "description": "He weaponizes his own pain to trap you.",
        "example": "He threatens suicide if you break up with him."
      },
      {
        "ref": "O-SBH9",
        "text": "Blocks access to support systems",
        "checked": false,
        "user_added": false,
        "description": "He builds a wall around you.",
        "example": "He changes the wifi password so you can't email your parents."
      },
      {
        "ref": "O-SBH10",
        "text": "Creates dependency by destabilizing the victim",
        "checked": false,
        "user_added": false,
        "description": "He makes the ground shake so you have to hold onto him.",
        "example": "He constantly moves you to new houses so you never feel settled."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-SBH1",
        "text": "She loses progress in life due to emotional instability caused by him.",
        "checked": false,
        "user_added": false,
        "description": "You are running a race with weights on your ankles.",
        "example": "You drop out of school because the home environment is too chaotic to study."
      },
      {
        "ref": "V-SBH2",
        "text": "She isolates from supportive people because of narratives he planted.",
        "checked": false,
        "user_added": false,
        "description": "You are hiding from your allies because you think they are enemies.",
        "example": "You stop talking to your sister because you believe she is jealous of your relationship."
      },
      {
        "ref": "V-SBH3",
        "text": "She avoids opportunities that require independence.",
        "checked": false,
        "user_added": false,
        "description": "You turn down chances to grow because growing means leaving him behind.",
        "example": "You reject a job offer in another city."
      },
      {
        "ref": "V-SBH4",
        "text": "She experiences setbacks that trace back to moments of his interference.",
        "checked": false,
        "user_added": false,
        "description": "His fingerprints are on your failures.",
        "example": "You miss a flight because he started a fight just as you were leaving."
      },
      {
        "ref": "V-SBH5",
        "text": "She believes she is incapable because of doubts he implanted.",
        "checked": false,
        "user_added": false,
        "description": "You have adopted his low opinion of you.",
        "example": "You don't apply for the promotion because he said you aren't smart enough."
      },
      {
        "ref": "V-SBH6",
        "text": "She sacrifices personal goals out of guilt he created.",
        "checked": false,
        "user_added": false,
        "description": "You are paying for his happiness with your dreams.",
        "example": "You give up your gym membership because he says it takes time away from him."
      },
      {
        "ref": "V-SBH7",
        "text": "She hides aspirations because he made her feel undeserving.",
        "checked": false,
        "user_added": false,
        "description": "You keep your dreams secret so he can't crush them.",
        "example": "You write poetry in a hidden notebook he doesn't know about."
      },
      {
        "ref": "V-SBH8",
        "text": "She feels powerless to move forward without his approval.",
        "checked": false,
        "user_added": false,
        "description": "He has become the gatekeeper of your life.",
        "example": "You wait for him to say 'okay' before you make any plan."
      },
      {
        "ref": "V-SBH9",
        "text": "She believes failure is her fault even when he engineered it.",
        "checked": false,
        "user_added": false,
        "description": "You take the blame for his sabotage.",
        "example": "You blame yourself for being late, ignoring that he hid your keys."
      },
      {
        "ref": "V-SBH10",
        "text": "She becomes dependent because he sabotaged alternatives.",
        "checked": false,
        "user_added": false,
        "description": "You stay because he burned the bridges.",
        "example": "You rely on his car because he convinced you to sell yours."
      }
    ]
  },
  "IsolationStrategies": {
    "title": "Isolation and Social Control Strategies",
    "intro": "This section describes ways a person may become isolated from support or connection.",
    "description": "Isolation can happen through discouraging contact, creating conflict with others, relocating, or emotional pressure. Over time, the person may feel disconnected from people who once supported them. This section highlights the gradual nature of isolation and how it affects emotional wellbeing.",
    "offender_behavior": [
      {
        "ref": "O-ISO1",
        "text": "Abuser restricts victim's communication",
        "checked": false,
        "user_added": false,
        "description": "He acts as a firewall between you and the world.",
        "example": "He blocks numbers on your phone or monitors your emails."
      },
      {
        "ref": "O-ISO2",
        "text": "Victim becomes distant from loved ones",
        "checked": false,
        "user_added": false,
        "description": "He slowly stretches the distance until the cord snaps.",
        "example": "He makes you move to a town where you know no one."
      },
      {
        "ref": "O-ISO3",
        "text": "Victim hides interactions to avoid conflict",
        "checked": false,
        "user_added": false,
        "description": "He makes honesty dangerous, so you hide your social life.",
        "example": "You delete call history so he doesn't see you spoke to your brother."
      },
      {
        "ref": "O-ISO4",
        "text": "Abuser creates distrust between victim and others",
        "checked": false,
        "user_added": false,
        "description": "He wedges himself between you and your support.",
        "example": "He tells you that your friends are talking behind your back."
      },
      {
        "ref": "O-ISO5",
        "text": "Victim fears reconnecting with past supports",
        "checked": false,
        "user_added": false,
        "description": "He makes the bridge back feel unsafe to cross.",
        "example": "You are afraid to call your old friends because you think they will judge you for staying."
      },
      {
        "ref": "O-ISO6",
        "text": "Victim only trusts the abuser's perspective",
        "checked": false,
        "user_added": false,
        "description": "He becomes your only window to the world.",
        "example": "You believe the news only if he interprets it for you."
      },
      {
        "ref": "O-ISO7",
        "text": "Abuser monopolizes emotional space",
        "checked": false,
        "user_added": false,
        "description": "He sucks all the air out of the room.",
        "example": "He demands all your attention, leaving none for anyone else."
      },
      {
        "ref": "O-ISO8",
        "text": "Victim disappears socially",
        "checked": false,
        "user_added": false,
        "description": "He erases you from your own community.",
        "example": "You stop going to book club, gym, and family dinners."
      },
      {
        "ref": "O-ISO9",
        "text": "Victim becomes emotionally unreachable",
        "checked": false,
        "user_added": false,
        "description": "He builds a wall around your heart.",
        "example": "Even when you are with friends, you feel miles away."
      },
      {
        "ref": "O-ISO10",
        "text": "Victim avoids relationships to preserve the bond",
        "checked": false,
        "user_added": false,
        "description": "He demands exclusivity of your soul.",
        "example": "You cut off a male friend because he is jealous."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-ISO1",
        "text": "She hides messages or communication with others to avoid upsetting him.",
        "checked": false,
        "user_added": false,
        "description": "You are smuggling human connection like it's contraband.",
        "example": "You text your friend from the bathroom and delete it immediately."
      },
      {
        "ref": "V-ISO2",
        "text": "She disappears from people she once felt safe with.",
        "checked": false,
        "user_added": false,
        "description": "You fade away to keep the peace.",
        "example": "You stop returning calls and eventually the phone stops ringing."
      },
      {
        "ref": "V-ISO3",
        "text": "She avoids meeting people who might reveal his manipulation.",
        "checked": false,
        "user_added": false,
        "description": "You avoid mirrors that show you the ugly truth.",
        "example": "You skip lunch with the friend who told you he was toxic."
      },
      {
        "ref": "V-ISO4",
        "text": "She isolates accidentally because she is overwhelmed emotionally.",
        "checked": false,
        "user_added": false,
        "description": "You are too tired to maintain relationships.",
        "example": "You stay home because you don't have the energy to pretend to be happy."
      },
      {
        "ref": "V-ISO5",
        "text": "She becomes paranoid about others' motives because he shaped her worldview.",
        "checked": false,
        "user_added": false,
        "description": "You look at your friends through his suspicious eyes.",
        "example": "You think your mom is asking questions to spy on you, not because she cares."
      },
      {
        "ref": "V-ISO6",
        "text": "She reduces contact with the people who could help her escape the manipulation.",
        "checked": false,
        "user_added": false,
        "description": "You are cutting the ropes that could pull you to safety.",
        "example": "You stop seeing your therapist because he said it was a waste of money."
      },
      {
        "ref": "V-ISO7",
        "text": "She avoids loved ones out of guilt or shame he created.",
        "checked": false,
        "user_added": false,
        "description": "You feel too dirty to be around clean things.",
        "example": "You don't go home for Christmas because you feel like a disappointment."
      },
      {
        "ref": "V-ISO8",
        "text": "She becomes emotionally unreachable due to intense cognitive load.",
        "checked": false,
        "user_added": false,
        "description": "Your brain is full of him; there is no room for anyone else.",
        "example": "You forget your best friend's birthday because you were managing his crisis."
      },
      {
        "ref": "V-ISO9",
        "text": "She behaves as if he is her only reliable emotional source.",
        "checked": false,
        "user_added": false,
        "description": "You drink from the poisoned well because it's the only one left.",
        "example": "You tell him your secrets even though he uses them against you."
      },
      {
        "ref": "V-ISO10",
        "text": "She hides the extent of his involvement because she fears judgment.",
        "checked": false,
        "user_added": false,
        "description": "You protect his reputation to protect your dignity.",
        "example": "You tell people you chose to stay home, not that he forbade you to go."
      }
    ]
  },
  "EmotionalBaitingPatterns": {
    "title": "Emotional Baiting and Hooking Patterns",
    "offender_behavior": [
      {
        "ref": "O-EB1",
        "text": "Abuser creates emotional triggers to get reactions",
        "checked": false,
        "user_added": false,
        "description": "He pushes your buttons because he installed them.",
        "example": "He mentions your weight knowing it will make you cry."
      },
      {
        "ref": "O-EB2",
        "text": "Victim responds predictably to bait",
        "checked": false,
        "user_added": false,
        "description": "He treats you like a machine: input insult, output tears.",
        "example": "He smirks when you start yelling, satisfied that he made you lose control."
      },
      {
        "ref": "O-EB3",
        "text": "Emotional highs followed by lows",
        "checked": false,
        "user_added": false,
        "description": "He creates whiplash to keep you disoriented.",
        "example": "He takes you on a dream date, then ignores you the whole ride home."
      },
      {
        "ref": "O-EB4",
        "text": "Abuser pulls victim in before pulling away",
        "checked": false,
        "user_added": false,
        "description": "He uses closeness as a trap.",
        "example": "He holds you tight, then suddenly pushes you away and says you're clingy."
      },
      {
        "ref": "O-EB5",
        "text": "Victim chases connection",
        "checked": false,
        "user_added": false,
        "description": "He runs so you will chase.",
        "example": "He leaves the house during a fight, knowing you will call him 20 times."
      },
      {
        "ref": "O-EB6",
        "text": "Victim feels addicted to reassurance",
        "checked": false,
        "user_added": false,
        "description": "He creates the insecurity that only he can soothe.",
        "example": "He makes you feel ugly so you need him to call you pretty."
      },
      {
        "ref": "O-EB7",
        "text": "Abuser triggers guilt deliberately",
        "checked": false,
        "user_added": false,
        "description": "He uses guilt as a remote control.",
        "example": "He sighs about how lonely he is to make you cancel your plans."
      },
      {
        "ref": "O-EB8",
        "text": "Victim becomes busy calming the abuser",
        "checked": false,
        "user_added": false,
        "description": "He creates the storm so you have to batten down the hatches.",
        "example": "You spend your whole evening managing his bad mood."
      },
      {
        "ref": "O-EB9",
        "text": "Victim experiences anticipatory anxiety",
        "checked": false,
        "user_added": false,
        "description": "He trains you to fear the future.",
        "example": "You worry all day about what mood he will be in when he gets home."
      },
      {
        "ref": "O-EB10",
        "text": "Victim becomes reactive to emotional cues",
        "checked": false,
        "user_added": false,
        "description": "He has sensitized you to his every move.",
        "example": "You flinch when he raises an eyebrow."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-EB1",
        "text": "She reacts strongly when he triggers an emotional hook.",
        "checked": false,
        "user_added": false,
        "description": "Your reaction is proof of your wound, not your weakness.",
        "example": "You scream when he insults your mother because he knows it hurts you."
      },
      {
        "ref": "V-EB2",
        "text": "She shows anxiety waiting for his approval or next message.",
        "checked": false,
        "user_added": false,
        "description": "You are on standby, waiting for him to activate you.",
        "example": "You stare at your phone for hours, unable to focus until he texts."
      },
      {
        "ref": "V-EB3",
        "text": "She seeks his reassurance after emotional baiting.",
        "checked": false,
        "user_added": false,
        "description": "You go to the person who hurt you to heal you.",
        "example": "After he insults you, you ask, 'Do you still love me?'"
      },
      {
        "ref": "V-EB4",
        "text": "She feels relief when he stops being cold, which strengthens the bond.",
        "checked": false,
        "user_added": false,
        "description": "The end of pain feels like pleasure.",
        "example": "You feel euphoric just because he started speaking to you again."
      },
      {
        "ref": "V-EB5",
        "text": "She apologizes even when the conflict was engineered by him.",
        "checked": false,
        "user_added": false,
        "description": "You pay the price for his manufactured war.",
        "example": "You say sorry for 'making him mad' when he woke up angry."
      },
      {
        "ref": "V-EB6",
        "text": "She engages with him even when she knows she shouldn't.",
        "checked": false,
        "user_added": false,
        "description": "You take the bait because you are starving for resolution.",
        "example": "You argue back even though you know it's what he wants."
      },
      {
        "ref": "V-EB7",
        "text": "She responds immediately to him due to emotional conditioning.",
        "checked": false,
        "user_added": false,
        "description": "You are trained to jump when he says jump.",
        "example": "You pick up his call on the first ring, every time."
      },
      {
        "ref": "V-EB8",
        "text": "She becomes emotionally dysregulated by his silence or coldness.",
        "checked": false,
        "user_added": false,
        "description": "His withdrawal pulls the rug out from under you.",
        "example": "You can't stop crying because he blocked you on social media."
      },
      {
        "ref": "V-EB9",
        "text": "She cannot disengage because he conditioned her reactions.",
        "checked": false,
        "user_added": false,
        "description": "You are caught in the web.",
        "example": "You keep texting him explaining yourself, unable to put the phone down."
      },
      {
        "ref": "V-EB10",
        "text": "She stays in the cycle because the emotional rewards feel intense.",
        "checked": false,
        "user_added": false,
        "description": "The highs are as addictive as the lows are destructive.",
        "example": "You stay for the makeup sex and the tearful reunions."
      }
    ]
  },
  "RoleReversalManipulation": {
    "title": "Role Reversal, Projection, and Blame-Shifting",
    "intro": "This section focuses on situations where responsibility becomes reversed in confusing ways.",
    "description": "Role reversal happens when someone is blamed for problems they didn’t cause, made to feel responsible for another person’s emotions, or assigned the role of ‘fixer’ or ‘protector’ when they are the one under pressure. This section explains how role reversal alters self-perception and emotional balance.",
    "offender_behavior": [
      {
        "ref": "O-RR1",
        "text": "Abuser portrays himself as the victim",
        "checked": false,
        "user_added": false,
        "description": "He cries 'ouch' while he is hitting you.",
        "example": "He accuses you of hurting him by asking him to stop yelling."
      },
      {
        "ref": "O-RR2",
        "text": "Victim adopts responsibility for abuser's actions",
        "checked": false,
        "user_added": false,
        "description": "He makes you the author of his behavior.",
        "example": "He says, 'I wouldn't drink if you were more supportive,' and you believe him."
      },
      {
        "ref": "O-RR3",
        "text": "Abuser blames victim for things she didn't do",
        "checked": false,
        "user_added": false,
        "description": "He invents crimes to justify his punishment.",
        "example": "He accuses you of cheating because you smiled at the cashier."
      },
      {
        "ref": "O-RR4",
        "text": "Victim internalizes blame",
        "checked": false,
        "user_added": false,
        "description": "He throws the hot potato of guilt, and you catch it.",
        "example": "You feel guilty for the mess he made in the kitchen."
      },
      {
        "ref": "O-RR5",
        "text": "Abuser reframes accountability as her fault",
        "checked": false,
        "user_added": false,
        "description": "He turns his obligations into your failures.",
        "example": "He blames you for him being late to work because you didn't wake him up."
      },
      {
        "ref": "O-RR6",
        "text": "Victim apologizes for his behavior",
        "checked": false,
        "user_added": false,
        "description": "You clean up his emotional spills.",
        "example": "You tell the neighbors, 'Sorry about the noise, he's just stressed.'"
      },
      {
        "ref": "O-RR7",
        "text": "Victim takes on the emotional labor",
        "checked": false,
        "user_added": false,
        "description": "You are the manager of his feelings.",
        "example": "You spend hours talking him down from a rage he created."
      },
      {
        "ref": "O-RR8",
        "text": "Abuser positions himself as misunderstood",
        "checked": false,
        "user_added": false,
        "description": "He claims his complexity excuses his cruelty.",
        "example": "He says, 'You just don't get me,' when you ask him to be nice."
      },
      {
        "ref": "O-RR9",
        "text": "Victim protects him from consequences",
        "checked": false,
        "user_added": false,
        "description": "You stand between him and the wall.",
        "example": "You lie to his boss to keep him from getting fired."
      },
      {
        "ref": "O-RR10",
        "text": "Victim becomes the stabilizer of his emotional world",
        "checked": false,
        "user_added": false,
        "description": "You are the ballast in his storm.",
        "example": "You stay calm so he doesn't have to."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-RR1",
        "text": "She apologizes for things he did to her.",
        "checked": false,
        "user_added": false,
        "description": "You are apologizing for being in the way of his fist.",
        "example": "You say 'I'm sorry' after he insults you."
      },
      {
        "ref": "V-RR2",
        "text": "She believes she caused him stress or pain that he caused himself.",
        "checked": false,
        "user_added": false,
        "description": "You accept the blame for his self-sabotage.",
        "example": "You feel bad that he has a hangover."
      },
      {
        "ref": "V-RR3",
        "text": "She defends him by saying he is misunderstood or hurting.",
        "checked": false,
        "user_added": false,
        "description": "You use his pain to excuse his behavior.",
        "example": "You tell your friends, 'He's had a hard life,' to explain why he screams at you."
      },
      {
        "ref": "V-RR4",
        "text": "She feels obligated to protect him from consequences.",
        "checked": false,
        "user_added": false,
        "description": "You act as his human shield.",
        "example": "You pay his speeding ticket so he doesn't lose his license."
      },
      {
        "ref": "V-RR5",
        "text": "She becomes responsible for managing his emotions.",
        "checked": false,
        "user_added": false,
        "description": "You are working overtime in the factory of his feelings.",
        "example": "You change the topic of conversation to prevent him from getting angry."
      },
      {
        "ref": "V-RR6",
        "text": "She becomes guilty for expressing her own needs.",
        "checked": false,
        "user_added": false,
        "description": "You feel like your needs are attacks on him.",
        "example": "You feel selfish for asking him to do the dishes."
      },
      {
        "ref": "V-RR7",
        "text": "She internalizes blame due to his projections.",
        "checked": false,
        "user_added": false,
        "description": "You look in the mirror and see the flaws he pointed out.",
        "example": "You think you are lazy because he calls you lazy, even though you work two jobs."
      },
      {
        "ref": "V-RR8",
        "text": "She believes she is the problem because he reframed reality.",
        "checked": false,
        "user_added": false,
        "description": "You have accepted the role of the villain in his story.",
        "example": "You think, 'If I was better, he would be happy.'"
      },
      {
        "ref": "V-RR9",
        "text": "She becomes emotionally responsible for conflict he created.",
        "checked": false,
        "user_added": false,
        "description": "You are the janitor of his mess.",
        "example": "You try to fix the fight he started with the waiter."
      },
      {
        "ref": "V-RR10",
        "text": "She acts as though she needs to earn forgiveness for things she didn't do.",
        "checked": false,
        "user_added": false,
        "description": "You are constantly in debt to him.",
        "example": "You buy him gifts to make up for a fight he picked."
      }
    ]
  },
  "ConfusionCycleMarkers": {
    "title": "Confusion Cycles and Mental Overload Patterns",
    "intro": "This section outlines signs that someone is stuck in repeated cycles of confusion.",
    "description": "Confusion cycles happen when mixed messages, shifting behaviour, and emotional pressure overload the mind. A person may forget what they felt yesterday, struggle to think clearly, or change opinions frequently. This section highlights markers that show confusion has become part of the emotional pattern.",
    "offender_behavior": [
      {
        "ref": "O-CF1",
        "text": "Victim struggles to understand what is happening",
        "checked": false,
        "user_added": false,
        "description": "He keeps the water muddy so you can't see the bottom.",
        "example": "He gives you circular arguments that make no sense until you give up."
      },
      {
        "ref": "O-CF2",
        "text": "Abuser floods with mixed messages",
        "checked": false,
        "user_added": false,
        "description": "He says 'I love you' and 'I hate you' in the same breath.",
        "example": "He buys you flowers but leaves a nasty note attached."
      },
      {
        "ref": "O-CF3",
        "text": "Contradictions cause decision paralysis",
        "checked": false,
        "user_added": false,
        "description": "He gives you impossible instructions.",
        "example": "He tells you to save money but yells at you for not buying nice things."
      },
      {
        "ref": "O-CF4",
        "text": "Victim becomes mentally exhausted",
        "checked": false,
        "user_added": false,
        "description": "He wears you down until you can't think.",
        "example": "He keeps you up all night arguing so you are too tired to fight back."
      },
      {
        "ref": "O-CF5",
        "text": "Victim forgets previous clarity",
        "checked": false,
        "user_added": false,
        "description": "He erases your epiphanies.",
        "example": "You decide to leave, but he talks you in circles until you forget why you wanted to go."
      },
      {
        "ref": "O-CF6",
        "text": "Victim switches positions frequently",
        "checked": false,
        "user_added": false,
        "description": "He makes you spin like a top.",
        "example": "You agree with him, then disagree, then agree again, trying to find the 'right' answer."
      },
      {
        "ref": "O-CF7",
        "text": "Abuser exploits confusion to offer 'guidance'",
        "checked": false,
        "user_added": false,
        "description": "He creates the maze and then sells you the map.",
        "example": "He confuses you with complex financial jargon, then offers to handle the money for you."
      },
      {
        "ref": "O-CF8",
        "text": "Victim becomes reactive not thoughtful",
        "checked": false,
        "user_added": false,
        "description": "He keeps you in survival mode.",
        "example": "You snap at your kids because your nerves are frayed from his games."
      },
      {
        "ref": "O-CF9",
        "text": "Victim's identity becomes unstable",
        "checked": false,
        "user_added": false,
        "description": "He shakes your foundation until it cracks.",
        "example": "You feel like you are a different person every day depending on his mood."
      },
      {
        "ref": "O-CF10",
        "text": "Victim loses cognitive grounding",
        "checked": false,
        "user_added": false,
        "description": "He cuts your tether to reality.",
        "example": "You feel like you are floating in space, untethered to facts."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-CF1",
        "text": "She becomes mentally overwhelmed and shuts down when confronted with conflicting truths.",
        "checked": false,
        "user_added": false,
        "description": "Your brain protects you by turning off.",
        "example": "You go blank when trying to reconcile his kindness with his cruelty."
      },
      {
        "ref": "V-CF2",
        "text": "She forgets clarity she had the day before and reverts to confusion.",
        "checked": false,
        "user_added": false,
        "description": "The fog rolls back in.",
        "example": "You wake up determined to leave, but by noon you are confused again."
      },
      {
        "ref": "V-CF3",
        "text": "She switches between viewpoints because her cognitive stability is fractured.",
        "checked": false,
        "user_added": false,
        "description": "You are grasping at straws.",
        "example": "You tell your friend he is abusive, then ten minutes later say he is wonderful."
      },
      {
        "ref": "V-CF4",
        "text": "She struggles to form consistent narratives because he destabilized her mentally.",
        "checked": false,
        "user_added": false,
        "description": "Your story keeps changing because the facts keep moving.",
        "example": "You can't explain your relationship to others because it doesn't make sense."
      },
      {
        "ref": "V-CF5",
        "text": "She becomes dependent on him to interpret reality.",
        "checked": false,
        "user_added": false,
        "description": "He is your translator for the world.",
        "example": "You look at him to know if a joke was funny."
      },
      {
        "ref": "V-CF6",
        "text": "She becomes confused when others give her a clearer perspective.",
        "checked": false,
        "user_added": false,
        "description": "The light hurts your eyes.",
        "example": "You get a headache when your therapist explains gaslighting."
      },
      {
        "ref": "V-CF7",
        "text": "She experiences cognitive fatigue from emotional overload.",
        "checked": false,
        "user_added": false,
        "description": "Thinking feels like wading through mud.",
        "example": "You can't focus on reading a book because your brain is tired."
      },
      {
        "ref": "V-CF8",
        "text": "She avoids thinking deeply because confusion feels painful.",
        "checked": false,
        "user_added": false,
        "description": "You stay on the surface to avoid the monsters below.",
        "example": "You distract yourself with TV to stop thinking about your life."
      },
      {
        "ref": "V-CF9",
        "text": "She believes the situation is too complex to understand, so she retreats emotionally.",
        "checked": false,
        "user_added": false,
        "description": "You accept the chaos as inevitable.",
        "example": "You say, 'It's complicated,' to avoid explaining the abuse."
      },
      {
        "ref": "V-CF10",
        "text": "She relies on emotional instinct rather than logic because logic became inaccessible.",
        "checked": false,
        "user_added": false,
        "description": "You are navigating by feel because he broke your compass.",
        "example": "You make decisions based on what feels safest in the moment, not what makes sense."
      }
    ]
  },
  "CollapseTriggers": {
    "title": "Emotional Collapse Triggers",
    "intro": "This section explores moments that overwhelm a person’s emotional capacity.",
    "description": "Collapse can occur when conflicting emotions, fear of loss, guilt, or sudden clarity become too intense. The person may shut down, withdraw, or feel unable to handle the moment. This section describes common triggers and why emotional collapse happens in stressful relationships.",
    "offender_behavior": [
      {
        "ref": "O-CT1",
        "text": "Moments where truth threatens the bond",
        "checked": false,
        "user_added": false,
        "description": "The house of cards is shaking.",
        "example": "Finding evidence of his lies triggers a breakdown because it threatens your reality."
      },
      {
        "ref": "O-CT2",
        "text": "Feeling exposed or caught in contradictions",
        "checked": false,
        "user_added": false,
        "description": "He corners you with your own confusion.",
        "example": "He points out a mistake you made and you collapse in shame."
      },
      {
        "ref": "O-CT3",
        "text": "Fear of losing the abuser's approval",
        "checked": false,
        "user_added": false,
        "description": "He is your sun; his shadow is cold.",
        "example": "You panic when he stops smiling at you."
      },
      {
        "ref": "O-CT4",
        "text": "Conflicting loyalties cause emotional breakdown",
        "checked": false,
        "user_added": false,
        "description": "He pulls one arm, your family pulls the other.",
        "example": "You cry because you have to choose between him and your mother."
      },
      {
        "ref": "O-CT5",
        "text": "Memories returning suddenly",
        "checked": false,
        "user_added": false,
        "description": "The dam breaks.",
        "example": "A smell triggers a flashback to a violent night, and you fall apart."
      },
      {
        "ref": "O-CT6",
        "text": "Shame from seeing red flags",
        "checked": false,
        "user_added": false,
        "description": "You hate yourself for staying.",
        "example": "You realize he is isolating you and feel sick with self-loathing."
      },
      {
        "ref": "O-CT7",
        "text": "Realizing time was lost",
        "checked": false,
        "user_added": false,
        "description": "The grief of stolen years hits you.",
        "example": "You look at the calendar and realize you've lost five years to him."
      },
      {
        "ref": "O-CT8",
        "text": "Feeling responsible for the abuser",
        "checked": false,
        "user_added": false,
        "description": "His pain feels like your failure.",
        "example": "You break down because you couldn't 'fix' his bad mood."
      },
      {
        "ref": "O-CT9",
        "text": "Fear of starting over",
        "checked": false,
        "user_added": false,
        "description": "The mountain looks too high to climb.",
        "example": "You think about leaving and are paralyzed by the logistics."
      },
      {
        "ref": "O-CT10",
        "text": "Fear of abandonment the abuser created",
        "checked": false,
        "user_added": false,
        "description": "He planted the fear that you are unlovable.",
        "example": "You beg him not to leave, terrified of being alone."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-CT1",
        "text": "She emotionally collapses when confronted with the reality of his manipulation.",
        "checked": false,
        "user_added": false,
        "description": "The truth is a physical blow.",
        "example": "You fall to your knees when you realize he never loved you."
      },
      {
        "ref": "V-CT2",
        "text": "She reacts with panic when she remembers something he tried to suppress.",
        "checked": false,
        "user_added": false,
        "description": "The return of the repressed is terrifying.",
        "example": "You gasp when you remember he hit the wall, not you."
      },
      {
        "ref": "V-CT3",
        "text": "She shuts down when her loyalty to him conflicts with truth.",
        "checked": false,
        "user_added": false,
        "description": "You can't hold both realities, so you drop both.",
        "example": "You go silent when the police ask what happened."
      },
      {
        "ref": "V-CT4",
        "text": "She becomes distressed when her past actions don't match her current feelings.",
        "checked": false,
        "user_added": false,
        "description": "You are judging your past self with present eyes.",
        "example": "You cry asking, 'Why did I stay?'"
      },
      {
        "ref": "V-CT5",
        "text": "She dissociates when she sees red flags too clearly.",
        "checked": false,
        "user_added": false,
        "description": "Your brain unplugs the TV when the movie gets too scary.",
        "example": "You zone out when reading a checklist of abusive behaviors."
      },
      {
        "ref": "V-CT6",
        "text": "She panics when she fears losing his approval.",
        "checked": false,
        "user_added": false,
        "description": "You are addicted to his validation.",
        "example": "You have a panic attack because you think he is mad."
      },
      {
        "ref": "V-CT7",
        "text": "She becomes emotional when guilt and shame overload her.",
        "checked": false,
        "user_added": false,
        "description": "The internal pressure cooker explodes.",
        "example": "You sob uncontrollably from the weight of your secrets."
      },
      {
        "ref": "V-CT8",
        "text": "She avoids questions that might reveal uncomfortable truths.",
        "checked": false,
        "user_added": false,
        "description": "You dodge the bullets of truth.",
        "example": "You leave the room when the news talks about domestic violence."
      },
      {
        "ref": "V-CT9",
        "text": "She shuts down emotionally when confronted with contradictory evidence.",
        "checked": false,
        "user_added": false,
        "description": "Cognitive dissonance triggers a reboot.",
        "example": "You stare blankly when shown proof of his cheating."
      },
      {
        "ref": "V-CT10",
        "text": "She becomes overwhelmed when she realizes she has been manipulated.",
        "checked": false,
        "user_added": false,
        "description": "The realization is a tsunami.",
        "example": "You feel like you are drowning as the pieces click into place."
      }
    ]
  },
  "MemoryRepressionMarkers": {
    "title": "Memory Repression and Fragmentation Markers",
    "intro": "This section focuses on signs that certain memories became difficult to access or trust.",
    "description": "Memory repression can happen when events are too stressful or confusing to process at the time. Memories may feel foggy, incomplete, or contradictory. This section highlights patterns that suggest memories have been pushed aside or reshaped to reduce emotional discomfort.",
    "offender_behavior": [
      {
        "ref": "O-MR1",
        "text": "Inability to recall certain events clearly",
        "checked": false,
        "user_added": false,
        "description": "He created trauma that your brain refused to record.",
        "example": "You can't remember the drive home after the fight."
      },
      {
        "ref": "O-MR2",
        "text": "Selective memory shaped by emotional survival",
        "checked": false,
        "user_added": false,
        "description": "He taught you what to remember and what to forget.",
        "example": "You only remember the makeup sex, not the hour of screaming before it."
      },
      {
        "ref": "O-MR3",
        "text": "Blocking out stressful periods",
        "checked": false,
        "user_added": false,
        "description": "Your brain deleted the bad files.",
        "example": "You have no memory of the week he moved in."
      },
      {
        "ref": "O-MR4",
        "text": "Rewriting memories to match abuser's narrative",
        "checked": false,
        "user_added": false,
        "description": "He relentlessly imposes his version of events over yours until your original memory fades. By engaging you in circular arguments and denying your reality, he forces your brain to accept his fiction as the truth just to end the conflict.",
        "example": "You clearly remember him pushing you, but after hours of him insisting you 'tripped because you were clumsy,' you actually start to visualize yourself tripping instead of being pushed."
      },
      {
        "ref": "O-MR5",
        "text": "Conflicted memories that cause distress",
        "checked": false,
        "user_added": false,
        "description": "He creates a painful dissonance between what you felt and what you were told. Your body remembers the fear, but your mind has been trained to label it as 'passion' or 'stress,' leaving you in a state of constant internal friction.",
        "example": "You have a memory of a 'romantic' anniversary dinner, but every time you think of it, your stomach knots up in anxiety because your body remembers the silent treatment that happened right before the meal."
      },
      {
        "ref": "O-MR6",
        "text": "Difficulty forming coherent timeline",
        "checked": false,
        "user_added": false,
        "description": "He creates chaos that disrupts your ability to encode time linearly. Because you are living in a state of constant survival—moment to moment—your brain stops tracking the 'big picture' or the passage of weeks and months.",
        "example": "You cannot say for sure if a specific abusive incident happened last week or last month; the days blur together into one long stretch of managing his moods."
      },
      {
        "ref": "O-MR7",
        "text": "Avoidance of thinking about certain days or events",
        "checked": false,
        "user_added": false,
        "description": "He has made certain memories so radioactive with shame or fear that your mind instinctively steers around them. This is a protective reflex to keep you functioning without collapsing into trauma every day.",
        "example": "You completely skip over your last birthday when talking about your year, because thinking about it brings up a flash of him screaming at you that feels too dangerous to touch."
      },
      {
        "ref": "O-MR8",
        "text": "Memory gaps in emotionally charged areas",
        "checked": false,
        "user_added": false,
        "description": "He pushes your nervous system beyond its recording limit. During peak abuse, your brain floods with stress hormones (cortisol) that physically shut down the hippocampus (memory center), resulting in black holes where the worst abuse occurred.",
        "example": "You remember him starting to yell, and then you remember crying on the floor an hour later, but the actual violence in between is completely gone from your mind."
      },
      {
        "ref": "O-MR9",
        "text": "Confusion about who said or did what",
        "checked": false,
        "user_added": false,
        "description": "He projects his actions onto you so frequently—accusing you of the very things he is doing—that your memory centers get crossed, and you start wondering if *you* were the one being abusive.",
        "example": "He calls you 'selfish' so often that when you look back on an argument, you remember yourself being the selfish one, even though you were actually begging for basic needs."
      },
      {
        "ref": "O-MR10",
        "text": "Feeling like memories belong to someone else",
        "checked": false,
        "user_added": false,
        "description": "He has eroded your identity so thoroughly that when you look back at memories, you are dissociated from the person in them. It feels like watching a movie of a stranger rather than recalling your own life.",
        "example": "You look at a photo of yourself from a year ago and feel zero connection to the woman in the picture, as if she is a character you read about in a book."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-MR1",
        "text": "She cannot remember details of painful incidents clearly.",
        "checked": false,
        "user_added": false,
        "description": "This is a biological survival mechanism, not a lack of intelligence. Your brain prioritized surviving the threat over recording the details, leaving you with a fragmented or blurry record of the trauma.",
        "example": "When a friend asks what exactly he said to make you cry, you find you can't quote him directly, only that you felt terrified and small."
      },
      {
        "ref": "V-MR2",
        "text": "She remembers events differently each time she describes them.",
        "checked": false,
        "user_added": false,
        "description": "Trauma is stored in fragments, not a linear story. As you try to piece it together, different sensory details surface, making your story seem inconsistent when it is actually just shattered.",
        "example": "One day you focus on how loud his voice was; the next day you remember the look in his eyes. To outsiders it sounds like the story changed, but you are just accessing different shards of the same pain."
      },
      {
        "ref": "V-MR3",
        "text": "She experiences memory fog around emotionally intense moments.",
        "checked": false,
        "user_added": false,
        "description": "Your cognitive load is maxed out by constantly scanning for danger. This 'fog' is your brain's way of conserving energy, shutting down non-essential processing—like memory formation—to keep you alert to his mood.",
        "example": "You walk out of a room after a tense conversation and realize five minutes later you have no idea what was actually agreed upon."
      },
      {
        "ref": "V-MR4",
        "text": "She recalls events only through his version of the story.",
        "checked": false,
        "user_added": false,
        "description": "You have learned that holding your own version of reality is dangerous because it leads to conflict. Adopting his narrative is a subconscious strategy to keep the peace and avoid punishment.",
        "example": "You tell your family, 'I overreacted and ruined the night,' using his exact words, even though deep down you know he started the fight."
      },
      {
        "ref": "V-MR5",
        "text": "She struggles to construct a clear timeline of events.",
        "checked": false,
        "user_added": false,
        "description": "Chronic abuse destroys the markers of time. When every day is a cycle of walking on eggshells, crises, and recovery, the days bleed together, making it impossible to say when specific events happened.",
        "example": "You know he threw your phone, but you genuinely can't remember if that was before or after Christmas, or even which year it was."
      },
      {
        "ref": "V-MR6",
        "text": "She avoids thinking about certain periods because they trigger shame or confusion.",
        "checked": false,
        "user_added": false,
        "description": "Your mind creates 'no-fly zones' around memories that are too painful to process while you are still in the environment. Avoiding them is how you maintain the strength to get through the day.",
        "example": "You instinctively change the subject in your own head whenever you start thinking about the time you tried to leave and came back."
      },
      {
        "ref": "V-MR7",
        "text": "She feels like some memories don't make sense anymore.",
        "checked": false,
        "user_added": false,
        "description": "Gaslighting works by introducing foreign data into your memory banks. You feel confused because you are trying to reconcile what you saw with the lies he has programmed you to believe.",
        "example": "You remember him being cruel, but you also 'remember' him telling you he loves you in the same moment, and the two facts refuse to fit together."
      },
      {
        "ref": "V-MR8",
        "text": "She mixes up events or attributes actions to the wrong person.",
        "checked": false,
        "user_added": false,
        "description": "The stress of projection—where he blames you for his actions—can cause you to misattribute memories. You might remember *yourself* yelling, when really you were only yelling to be heard over his screaming.",
        "example": "You worry that you are the abuser because you remember screaming 'Stop it!' and he has convinced you that your volume was the aggression, not his violence."
      },
      {
        "ref": "V-MR9",
        "text": "She believes her own recollection is unreliable.",
        "checked": false,
        "user_added": false,
        "description": "After being told 'you're crazy' or 'you have a bad memory' thousands of times, you have learned to distrust your own mind. You outsource your truth to him because you believe he is the reliable narrator.",
        "example": "Even when you are 100% sure you left the keys on the table, you accept his claim that you lost them because you've lost faith in your own brain."
      },
      {
        "ref": "V-MR10",
        "text": "She becomes distressed when confronted with forgotten or suppressed memories.",
        "checked": false,
        "user_added": false,
        "description": "When a suppressed memory surfaces, it threatens the survival mechanism that kept it hidden. The distress is your system reacting to the sudden return of a pain you weren't ready to feel.",
        "example": "Seeing a photo of an old bruise makes you physically nauseous and panicked, even if you can't immediately recall how you got it."
      }
    ]
  },
  "VictimLanguageAnalysis": {
    "title": "Victim Language Analysis (How Speech Reveals Manipulation)",
    "intro": "This section looks at how language patterns can reveal emotional pressure or learned responses.",
    "description": "Over time, someone may begin repeating phrases, explanations, or logic that came from another person rather than themselves. Apologising excessively, minimising emotions, or contradicting oneself can reflect internalised pressure. This section examines subtle shifts in speech that show emotional influence.",
    "offender_behavior": [
      {
        "ref": "O-VL1",
        "text": "Over-apologizing",
        "checked": false,
        "user_added": false,
        "description": "He has conditioned you to believe that your existence is an inconvenience. He demands an apology not just for your mistakes, but for his moods, training you to preemptively apologize to de-escalate potential violence.",
        "example": "He glares at you when he drops his own keys, and you immediately say 'I'm sorry' because you know he needs someone to blame."
      },
      {
        "ref": "O-VL2",
        "text": "Self-blame language",
        "checked": false,
        "user_added": false,
        "description": "He consistently externalizes his responsibility, refusing to accept fault. Over time, he forces you to pick up the blame he drops, ensuring that you verbally accept liability for the relationship's problems.",
        "example": "He says, 'We wouldn't fight if you weren't so sensitive,' until you start telling friends, 'I just need to work on not being so sensitive.'"
      },
      {
        "ref": "O-VL3",
        "text": "Minimizing harm",
        "checked": false,
        "user_added": false,
        "description": "He punishes you for making a 'big deal' out of his abuse. He trains you to use soft language for hard actions, rewarding you when you downplay his violence and punishing you when you name it.",
        "example": "If you say 'you hit me,' he rages. If you say 'we got a little rough,' he accepts it. So you learn to speak in minimizations."
      },
      {
        "ref": "O-VL4",
        "text": "Repeating phrases abuser used",
        "checked": false,
        "user_added": false,
        "description": "He uses repetition to drill his catchphrases into your mind. He acts as a ventriloquist, ensuring that when you speak, his logic and his justifications come out of your mouth.",
        "example": "You catch yourself saying, 'It takes two to tango,' a phrase he uses constantly to avoid taking 100% responsibility for his own abuse."
      },
      {
        "ref": "O-VL5",
        "text": "Dismissing own emotions",
        "checked": false,
        "user_added": false,
        "description": "He mocks or invalidates your feelings until you learn to view them as irrelevant or annoying. He teaches you that your emotions are obstacles to his comfort, so you learn to verbally discard them.",
        "example": "He rolls his eyes when you cry, so now when you speak you preface it with, 'I know I'm being silly, but...' to avoid his judgment."
      },
      {
        "ref": "O-VL6",
        "text": "Using abuser's vocabulary",
        "checked": false,
        "user_added": false,
        "description": "He reshapes your language to match his reality. He introduces specific terms or nicknames to define you or the relationship, and insists you use them to reinforce his dominance.",
        "example": "He refers to your valid questions as 'nagging,' and eventually, you start asking him, 'I don't mean to nag, but...' adopting his framing."
      },
      {
        "ref": "O-VL7",
        "text": "Uncertainty in speech",
        "checked": false,
        "user_added": false,
        "description": "He attacks your certainty so frequently that you become afraid to make definitive statements. He trains you to speak in questions or qualifiers to leave room for him to correct you.",
        "example": "Instead of saying 'The movie starts at 7,' which he might challenge, you learn to say 'I think maybe it starts at 7?' to protect yourself from being 'wrong'."
      },
      {
        "ref": "O-VL8",
        "text": "Contradicting herself mid-sentence",
        "checked": false,
        "user_added": false,
        "description": "He creates a dual reality where you must acknowledge the truth but also protect his lie. This causes your speech to fracture as you try to navigate between reality and his required narrative.",
        "example": "You start to complain, 'He was really mean... well, not mean, he was just tired,' correcting yourself in real-time to avoid betraying him."
      },
      {
        "ref": "O-VL9",
        "text": "Being defensive of the abuser instantly",
        "checked": false,
        "user_added": false,
        "description": "He has instilled a fear that if others judge him, he will punish you. He makes you his PR manager, responsible for maintaining his image to the outside world to keep the peace at home.",
        "example": "When a friend raises an eyebrow at his behavior, you jump in immediately with, 'He's actually really stressed at work right now,' acting as a human shield."
      },
      {
        "ref": "O-VL10",
        "text": "Speech patterns showing fear of being wrong",
        "checked": false,
        "user_added": false,
        "description": "He weaponizes your mistakes, no matter how small. He creates an environment where being wrong results in disproportionate rage, forcing you to speak with extreme caution and hesitation.",
        "example": "You pause frequently and watch his face while talking, ready to stop or change your sentence the moment you see a flicker of disapproval."
      }
    ],
    "victim_behavior": [
      {
        "ref": "V-VL1",
        "text": "She uses phrases that clearly originate from his influence rather than her own thinking.",
        "checked": false,
        "user_added": false,
        "description": "You are surviving by merging with him. Adopting his language is a way to signal compliance and safety. It’s not that you believe these things; it’s that speaking his language reduces the target on your back.",
        "example": "You start saying that you are 'too emotional' and need to 'toughen up,' using the exact words he uses to dismiss your feelings."
      },
      {
        "ref": "V-VL2",
        "text": "She apologizes as a reflex before expressing any opinion.",
        "checked": false,
        "user_added": false,
        "description": "You have learned that having a separate thought is viewed as an act of rebellion. The apology is a 'peace offering' you present before speaking to show you are not trying to challenge his authority.",
        "example": "You say, 'I'm sorry, but I think I might prefer the other restaurant,' apologizing simply for having a preference."
      },
      {
        "ref": "V-VL3",
        "text": "She defends him with emotionally charged language that contradicts her previous values.",
        "checked": false,
        "user_added": false,
        "description": "Cognitive dissonance forces you to align your words with your situation. To survive the relationship, you have to verbally justify things you once would have condemned, just to keep your internal world from collapsing.",
        "example": "You used to be a feminist, but now you tell friends that 'men just have needs' to justify his controlling behavior."
      },
      {
        "ref": "V-VL4",
        "text": "She minimizes harmful events using softened language created by him.",
        "checked": false,
        "user_added": false,
        "description": "Language shapes reality. By using softer words, you make the unbearable reality of abuse feel more manageable. It is a psychological cushion to protect you from the full horror of your situation.",
        "example": "You describe a night where he punched a hole in the wall as 'a bit of a drama' or 'a bad patch,' stripping the violence of its weight."
      },
      {
        "ref": "V-VL5",
        "text": "She contradicts herself repeatedly because she is trying to maintain two conflicting realities.",
        "checked": false,
        "user_added": false,
        "description": "You are living in two worlds: the one you see and the one he tells you exists. Your speech falters because you are constantly translating between the truth and his required fiction.",
        "example": "You say, 'He is a wonderful father,' followed moments later by, 'I'm afraid to leave the kids alone with him,' revealing the conflict between the image and the truth."
      },
      {
        "ref": "V-VL6",
        "text": "She speaks hesitantly when discussing him, as if choosing words carefully.",
        "checked": false,
        "user_added": false,
        "description": "This is the 'walking on eggshells' manifested in speech. You are mentally editing every sentence before it leaves your mouth, scanning for anything that could be twisted or used against you later.",
        "example": "When asked how your weekend was, you pause for a long time, filtering out the fight, and say slowly, 'It was... quiet.'"
      },
      {
        "ref": "V-VL7",
        "text": "She asks for reassurance mid-sentence because her confidence is eroded.",
        "checked": false,
        "user_added": false,
        "description": "He has dismantled your self-trust to the point where you need external validation to finish a thought. You are checking to see if your perception is 'allowed' before you fully commit to it.",
        "example": "You tell a story and keep stopping to ask, 'Does that make sense? am I explaining it right?' because you expect to be told you are stupid."
      },
      {
        "ref": "V-VL8",
        "text": "She expresses guilt in her tone even when discussing neutral topics.",
        "checked": false,
        "user_added": false,
        "description": "Guilt has become your baseline emotional state. He has conditioned you to feel responsible for the emotional climate of the room, so you speak with an undertone of apology for simply taking up space.",
        "example": "You tell a friend you bought a new shirt, but your voice sounds guilty, as if you are confessing a crime, because you know he would criticize the spending."
      },
      {
        "ref": "V-VL9",
        "text": "She speaks as if she is responsible for his emotions, using phrases like 'I made him upset'.",
        "checked": false,
        "user_added": false,
        "description": "You have fully internalized the lie that you control his behavior. By using this language, you accept the burden of his abuse, believing that if you just behaved differently, he wouldn't hurt you.",
        "example": "Instead of saying 'He yelled at me,' you say 'I made him yell because I didn't clean the kitchen fast enough.'"
      },
      {
        "ref": "V-VL10",
        "text": "She echoes his narrative structure, using his metaphors, explanations, and logic.",
        "checked": false,
        "user_added": false,
        "description": "This is a sign of deep psychological enmeshment. You are using his mental map to navigate the world because he has convinced you that your own map is broken.",
        "example": "You explain your financial situation using his exact convoluted logic about 'investment cycles' to justify why you have no access to your own money."
      }
    ]
  }
}